renesas/rx-driver-package/source/r_ble_rx23w/r_ble_rx23w_vx.xx/r_ble_rx23w/src/app_lib/abs/r_ble_abs_api.h
/***********************************************************************************************************************
* DISCLAIMER
* This software is supplied by Renesas Electronics Corporation and is only intended for use with Renesas products. No
* other uses are authorized. This software is owned by Renesas Electronics Corporation and is protected under all
* applicable laws, including copyright laws.
* THIS SOFTWARE IS PROVIDED "AS IS" AND RENESAS MAKES NO WARRANTIES REGARDING
* THIS SOFTWARE, WHETHER EXPRESS, IMPLIED OR STATUTORY, INCLUDING BUT NOT LIMITED TO WARRANTIES OF MERCHANTABILITY,
* FITNESS FOR A PARTICULAR PURPOSE AND NON-INFRINGEMENT. ALL SUCH WARRANTIES ARE EXPRESSLY DISCLAIMED. TO THE MAXIMUM
* EXTENT PERMITTED NOT PROHIBITED BY LAW, NEITHER RENESAS ELECTRONICS CORPORATION NOR ANY OF ITS AFFILIATED COMPANIES
* SHALL BE LIABLE FOR ANY DIRECT, INDIRECT, SPECIAL, INCIDENTAL OR CONSEQUENTIAL DAMAGES FOR ANY REASON RELATED TO THIS
* SOFTWARE, EVEN IF RENESAS OR ITS AFFILIATES HAVE BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES.
* Renesas reserves the right, without notice, to make changes to this software and to discontinue the availability of
* this software. By using this software, you agree to the additional terms and conditions found by accessing the
* following link:
* http://www.renesas.com/disclaimer
*
* Copyright (C) 2019-2021 Renesas Electronics Corporation. All rights reserved.
***********************************************************************************************************************/
#ifndef R_BLE_ABS_API_H
#define R_BLE_ABS_API_H

/***********************************************************************************************************************
* File Name    : r_ble_abs_api.h
* Description  : Abstraction API
* History      : DD.MM.YYYY Version Description           
*              : 23.08.2019 1.00    First Release
***********************************************************************************************************************/

/*******************************************************************************************************************//**
 * @file
 * @defgroup abs_api Abstraction API
 * @{
 * @ingroup app_lib
 * @brief Abstraction API
 * @details This provides Abstraction API.
***********************************************************************************************************************/

/***********************************************************************************************************************
Includes   <System Includes> , "Project Includes"
***********************************************************************************************************************/
#include "r_ble_rx23w_if.h"


/** @defgroup abs_api_macro Macros 
 *  @{
 *  @brief Macro definition
 */

/***********************************************************************************************************************
 Macro definitions
 **********************************************************************************************************************/

/** 
 * @def BLE_ABS_ADV_PHY_LEGACY
 * @brief Non-Connectable Legacy Advertising phy setting with @ref R_BLE_ABS_StartNonConnAdv().
 */
#define BLE_ABS_ADV_PHY_LEGACY              (0x00)

/**
 * @def BLE_ABS_PRIV_MODE_MASK
 * @brief Privacy Mode Mask.
 */
#define BLE_ABS_PRIV_MODE_MASK              (0x0F)

/**
 * @def BLE_ABS_PRIV_ADDRESS_MASK
 * @brief Identity Address Type Mask.
 */
#define BLE_ABS_PRIV_ADDRESS_MASK           (0xF0)

/**
 * @def BLE_ABS_PRIV_NET_PUBLIC_IDADDR
 * @brief Privacy Mode : Network Mode, Identity Address : Public Address
 */
#define BLE_ABS_PRIV_NET_PUBLIC_IDADDR      (BLE_GAP_NET_PRIV_MODE | (BLE_GAP_ADDR_PUBLIC << 4))

/**
 * @def BLE_ABS_PRIV_DEV_PUBLIC_IDADDR
 * @brief Privacy Mode : Device Mode, Identity Address : Public Address
 */
#define BLE_ABS_PRIV_DEV_PUBLIC_IDADDR      (BLE_GAP_DEV_PRIV_MODE | (BLE_GAP_ADDR_PUBLIC << 4))

/**
 * @def BLE_ABS_PRIV_NET_STATIC_IDADDR
 * @brief Privacy Mode : Network Mode, Identity Address : Static Address
 */
#define BLE_ABS_PRIV_NET_STATIC_IDADDR      (BLE_GAP_NET_PRIV_MODE | (BLE_GAP_ADDR_RAND << 4))

/**
 * @def BLE_ABS_PRIV_DEV_STATIC_IDADDR
 * @brief Privacy Mode : Device Mode, Identity Address : Static Address
 */
#define BLE_ABS_PRIV_DEV_STATIC_IDADDR      (BLE_GAP_DEV_PRIV_MODE | (BLE_GAP_ADDR_RAND << 4))

/**
 * @def BLE_ABS_SCAN_FILT_MASK
 * @brief Scan Filter Policy Mask.
 */
#define BLE_ABS_SCAN_FILT_MASK              (0x0F)

/**
 * @def BLE_ABS_SCAN_LOC_ADDR_MASK
 * @brief Local Device Address Type Mask.
 */
#define BLE_ABS_SCAN_LOC_ADDR_MASK          (0xF0)

/**
 * @def BLE_ABS_SCAN_ALL_PUBLIC
 * @brief  Scan Filter Policy   : Accept all advertising and scan response PDUs except directed advertising PDUs 
 *                                not addressed to local device. \n
 *         Local Device Address : Public Address
 */
#define BLE_ABS_SCAN_ALL_PUBLIC             (BLE_GAP_SCAN_ALLOW_ADV_ALL | (BLE_GAP_ADDR_PUBLIC << 4))

/**
 * @def BLE_ABS_SCAN_WLST_PUBLIC
 * @brief  Scan Filter Policy   : Accept only advertising and scan response PDUs from remote devices 
 *                                whose address is registered in the White List. \n 
 *                                Directed advertising PDUs which are not addressed to local device is ignored. \n
 *         Local Device Address : Public Address
 */
#define BLE_ABS_SCAN_WLST_PUBLIC            (BLE_GAP_SCAN_ALLOW_ADV_WLST | (BLE_GAP_ADDR_PUBLIC << 4))

/**
 * @def BLE_ABS_SCAN_EXC_DIR_PUBLIC
 * @brief  Scan Filter Policy   : Accept all advertising and scan response PDUs except directed advertising PDUs 
 *                                whose the target address is identity address but doesn't address local device.  \n 
 *                                However directed advertising PDUs whose the target address is the local 
 *                                resolvable private address are accepted. \n 
 *         Local Device Address : Public Address
 */
#define BLE_ABS_SCAN_EXC_DIR_PUBLIC         (BLE_GAP_SCAN_ALLOW_ADV_EXCEPT_DIRECTED | (BLE_GAP_ADDR_PUBLIC << 4))

/**
 * @def BLE_ABS_SCAN_EXC_DIR_WLST_PUBLIC
 * @brief  Scan Filter Policy   : Accept all advertising and scan response PDUs. \n 
 *                               The following are excluded.  \n 
 *                               \arg Advertising and scan response PDUs where the advertiser's identity address 
 *                               is not in the White List. \n \arg Directed advertising PDUs 
 *                               whose the target address is identity address but doesn't address local device.  \n
 *                               However directed advertising PDUs whose the target address is the local 
 *                               resolvable private address are accepted. \n
 *         Local Device Address : Public Address
 */
#define BLE_ABS_SCAN_EXC_DIR_WLST_PUBLIC    (BLE_GAP_SCAN_ALLOW_ADV_EXCEPT_DIRECTED_WLST | (BLE_GAP_ADDR_PUBLIC << 4))

/**
 * @def BLE_ABS_SCAN_ALL_STATIC
 * @brief  Scan Filter Policy   : Accept all advertising and scan response PDUs except directed advertising PDUs 
 *                                not addressed to local device. \n
 *         Local Device Address : Static Address
 */
#define BLE_ABS_SCAN_ALL_STATIC             (BLE_GAP_SCAN_ALLOW_ADV_ALL | (BLE_GAP_ADDR_RAND << 4))

/**
 * @def BLE_ABS_SCAN_WLST_STATIC
 * @brief  Scan Filter Policy   : Accept only advertising and scan response PDUs from remote devices 
 *                                whose address is registered in the White List. \n 
 *                                Directed advertising PDUs which are not addressed to local device is ignored. \n 
 *         Local Device Address : Static Address
 */
#define BLE_ABS_SCAN_WLST_STATIC            (BLE_GAP_SCAN_ALLOW_ADV_WLST | (BLE_GAP_ADDR_RAND << 4))

/**
 * @def BLE_ABS_SCAN_EXC_DIR_STATIC
 * @brief  Scan Filter Policy   : Accept all advertising and scan response PDUs except directed advertising PDUs 
 *                                whose the target address is identity address but doesn't address local device. \n 
 *                                However directed advertising PDUs whose the target address is the local 
 *                                resolvable private address are accepted. \n 
 *         Local Device Address : Static Address
 */
#define BLE_ABS_SCAN_EXC_DIR_STATIC         (BLE_GAP_SCAN_ALLOW_ADV_EXCEPT_DIRECTED | (BLE_GAP_ADDR_RAND << 4))

/**
 * @def BLE_ABS_SCAN_EXC_DIR_WLST_STATIC
 * @brief  Scan Filter Policy   : Accept all advertising and scan response PDUs. \n 
 *                                The following are excluded. \n 
 *                                \arg Advertising and scan response PDUs where the advertiser's identity address 
 *                                is not in the White List. \n \arg Directed advertising PDUs 
 *                                whose the target address is identity address but doesn't address local device. \n 
 *                                However directed advertising PDUs whose the target address is the local 
 *                                resolvable private address are accepted. \n 
 *         Local Device Address : Static Address
 */
#define BLE_ABS_SCAN_EXC_DIR_WLST_STATIC    (BLE_GAP_SCAN_ALLOW_ADV_EXCEPT_DIRECTED_WLST | (BLE_GAP_ADDR_RAND << 4))

/**
 * @def BLE_ABS_SCAN_ALL_RPA_PUBLIC
 * @brief  Scan Filter Policy   : Accept all advertising and scan response PDUs except directed advertising PDUs 
 *                                not addressed to local device. \n
 *         Local Device Address : Resolvable Private Address. \n
 *                                If the IRK of local device has not been registered in Resolving List, 
 *                                Public Address is used. \n
 */
#define BLE_ABS_SCAN_ALL_RPA_PUBLIC         (BLE_GAP_SCAN_ALLOW_ADV_ALL | (BLE_GAP_ADDR_RPA_ID_PUBLIC << 4))

/**
 * @def BLE_ABS_SCAN_WLST_RPA_PUBLIC
 * @brief  Scan Filter Policy   : Accept only advertising and scan response PDUs from remote devices 
 *                                whose address is registered in the White List. \n 
 *                                Directed advertising PDUs which are not addressed to local device is ignored.
 *         Local Device Address : Resolvable Private Address. \n
 *                                If the IRK of local device has not been registered in Resolving List, 
 *                                Public Address is used. \n
 */
#define BLE_ABS_SCAN_WLST_RPA_PUBLIC        (BLE_GAP_SCAN_ALLOW_ADV_WLST | (BLE_GAP_ADDR_RPA_ID_PUBLIC << 4))

/**
 * @def BLE_ABS_SCAN_EXC_DIR_RPA_PUBLIC
 * @brief  Scan Filter Policy   : Accept all advertising and scan response PDUs except directed advertising PDUs 
 *                                whose the target address is identity address but doesn't address local device. \n
 *                                However directed advertising PDUs whose the target address is the local 
 *                                resolvable private address are accepted. \n
 *         Local Device Address : Resolvable Private Address. \n
 *                                If the IRK of local device has not been registered in Resolving List, 
 *                                Public Address is used. \n
 */
#define BLE_ABS_SCAN_EXC_DIR_RPA_PUBLIC     (BLE_GAP_SCAN_ALLOW_ADV_EXCEPT_DIRECTED | (BLE_GAP_ADDR_RPA_ID_PUBLIC << 4))

/**
 * @def BLE_ABS_SCAN_EXC_DIR_WLST_RPA_PUBLIC
 * @brief  Scan Filter Policy   : Accept all advertising and scan response PDUs. \n 
 *                                The following are excluded.  \n 
 *                                \arg Advertising and scan response PDUs where the advertiser's identity address 
 *                                is not in the White List. \n \arg Directed advertising PDUs 
 *                                whose the target address is identity address but doesn't address local device. 
 *                                However directed advertising PDUs whose the target address is the local 
 *                                resolvable private address are accepted.
 *         Local Device Address : Resolvable Private Address. \n
 *                                If the IRK of local device has not been registered in Resolving List, 
 *                                Public Address is used.
 */
#define BLE_ABS_SCAN_EXC_DIR_WLST_RPA_PUBLIC  (BLE_GAP_SCAN_ALLOW_ADV_EXCEPT_DIRECTED_WLST | (BLE_GAP_ADDR_RPA_ID_PUBLIC << 4))

/**
 * @def BLE_ABS_SCAN_ALL_RPA_STATIC
 * @brief  Scan Filter Policy   : Accept all advertising and scan response PDUs except directed advertising PDUs 
 *                                not addressed to local device.
 *         Local Device Address : Resolvable Private Address. \n
 *                                If the IRK of local device has not been registered in Resolving List, 
 *                                the Static Address set by @ref R_BLE_GAP_SetRandAddr() or 
 *                                @ref R_BLE_VS_SetBdAddr() is used. 
 */
#define BLE_ABS_SCAN_ALL_RPA_STATIC         (BLE_GAP_SCAN_ALLOW_ADV_ALL | (BLE_GAP_ADDR_RPA_ID_RANDOM << 4))

/**
 * @def BLE_ABS_SCAN_WLST_RPA_STATIC
 * @brief  Scan Filter Policy : Accept only advertising and scan response PDUs from remote devices 
 *                            : whose address is registered in the White List. \n 
 *                            : Directed advertising PDUs which are not addressed to local device is ignored.
 *         Local Device Address : Resolvable Private Address. \n
 *                                If the IRK of local device has not been registered in Resolving List, 
 *                                the Static Address set by @ref R_BLE_GAP_SetRandAddr() or 
 *                                @ref R_BLE_VS_SetBdAddr() is used. 
 */
#define BLE_ABS_SCAN_WLST_RPA_STATIC        (BLE_GAP_SCAN_ALLOW_ADV_WLST | (BLE_GAP_ADDR_RPA_ID_RANDOM << 4))

/**
 * @def BLE_ABS_SCAN_EXC_DIR_RPA_STATIC
 * @brief  Scan Filter Policy : Accept all advertising and scan response PDUs except directed advertising PDUs 
 *                            : whose the target address is identity address but doesn't address local device. 
 *                            : However directed advertising PDUs whose the target address is the local 
 *                            : resolvable private address are accepted.
 *         Local Device Address : Resolvable Private Address. \n
 *                                If the IRK of local device has not been registered in Resolving List, 
 *                                the Static Address set by @ref R_BLE_GAP_SetRandAddr() or 
 *                                @ref R_BLE_VS_SetBdAddr() is used. 
 */
#define BLE_ABS_SCAN_EXC_DIR_RPA_STATIC     (BLE_GAP_SCAN_ALLOW_ADV_EXCEPT_DIRECTED | (BLE_GAP_ADDR_RPA_ID_RANDOM << 4))

/**
 * @def BLE_ABS_SCAN_EXC_DIR_WLST_RPA_STATIC
 * @brief  Scan Filter Policy : Accept all advertising and scan response PDUs. \n 
 *                              The following are excluded.  \n 
 *                              \arg Advertising and scan response PDUs where the advertiser's identity address 
 *                              is not in the White List. \n \arg Directed advertising PDUs 
 *                              whose the target address is identity address but doesn't address local device. 
 *                              However directed advertising PDUs whose the target address is the local 
 *                              resolvable private address are accepted.
 *         Local Device Address : Resolvable Private Address. \n
 *                                If the IRK of local device has not been registered in Resolving List, 
 *                                the Static Address set by @ref R_BLE_GAP_SetRandAddr() or 
 *                                @ref R_BLE_VS_SetBdAddr() is used. 
 */
#define BLE_ABS_SCAN_EXC_DIR_WLST_RPA_STATIC (BLE_GAP_SCAN_ALLOW_ADV_EXCEPT_DIRECTED_WLST | (BLE_GAP_ADDR_RPA_ID_RANDOM << 4))


/**
 * @def BLE_ABS_CONN_FILT_MASK
 * @brief Initiator Filter Policy Mask.
 */
#define BLE_ABS_CONN_FILT_MASK              (0x0F)

/**
 * @def BLE_ABS_CONN_LOC_ADDR_MASK
 * @brief Local Device Address Type Mask.
 */
#define BLE_ABS_CONN_LOC_ADDR_MASK          (0xF0)

/**
 * @def BLE_ABS_CONN_USE_ADDR_PUBLIC
 * @brief  Filter Policy        : White List is not used. \n The remote device to be connected is specified by 
 *                                the remote device address parameter is used. \n 
 *         Local Device Address : Public Address
 */
#define BLE_ABS_CONN_USE_ADDR_PUBLIC        (BLE_GAP_INIT_FILT_USE_ADDR | (BLE_GAP_ADDR_PUBLIC << 4))

/**
 * @def BLE_ABS_CONN_USE_WLST_PUBLIC
 * @brief  Filter Policy        : White List is used. \n The remote device registered in White List is connected 
 *                                with local device. \n The remote device address parameter is ignored. \n 
 *         Local Device Address : Public Address
 */
#define BLE_ABS_CONN_USE_WLST_PUBLIC        (BLE_GAP_INIT_FILT_USE_WLST | (BLE_GAP_ADDR_PUBLIC << 4))

/**
 * @def BLE_ABS_CONN_USE_ADDR_STATIC
 * @brief  Filter Policy        : White List is not used. \n The remote device to be connected is specified by 
 *                                the remote device address parameter is used. \n 
 *         Local Device Address : Static Address
 */
#define BLE_ABS_CONN_USE_ADDR_STATIC        (BLE_GAP_INIT_FILT_USE_ADDR | (BLE_GAP_ADDR_RAND << 4))

/**
 * @def BLE_ABS_CONN_USE_WLST_STATIC
 * @brief  Filter Policy        : White List is used. \n The remote device registered in White List is connected 
 *                                with local device. \n The p_addr field is ignored. \n 
 *         Local Device Address : Static Address
 */
#define BLE_ABS_CONN_USE_WLST_STATIC        (BLE_GAP_INIT_FILT_USE_WLST | (BLE_GAP_ADDR_RAND << 4))

/**
 * @def BLE_ABS_CONN_USE_ADDR_RPA_PUBLIC
 * @brief  Filter Policy        : White List is not used. \n The remote device to be connected is specified by 
 *                                the remote device address parameter is used. \n 
 *         Local Device Address : Resolvable Private Address. \n
 *                                If the IRK of local device has not been registered in Resolving List, 
 *                                Public Address is used.
 */
#define BLE_ABS_CONN_USE_ADDR_RPA_PUBLIC    (BLE_GAP_INIT_FILT_USE_ADDR | (BLE_GAP_ADDR_RPA_ID_PUBLIC << 4))

/**
 * @def BLE_ABS_CONN_USE_WLST_RPA_PUBLIC
 * @brief  Filter Policy        : White List is used. \n The remote device registered in White List is connected 
 *                                with local device. \n The p_addr field is ignored. \n 
 *         Local Device Address : Resolvable Private Address. \n
 *                                If the IRK of local device has not been registered in Resolving List, 
 *                                Public Address is used.
 */
#define BLE_ABS_CONN_USE_WLST_RPA_PUBLIC    (BLE_GAP_INIT_FILT_USE_WLST | (BLE_GAP_ADDR_RPA_ID_PUBLIC << 4))

/**
 * @def BLE_ABS_CONN_USE_ADDR_RPA_STATIC
 * @brief  Filter Policy        : White List is not used. \n The remote device to be connected is specified by 
 *                                the remote device address parameter is used. \n 
 *         Local Device Address : Resolvable Private Address. \n
 *                                If the IRK of local device has not been registered in Resolving List, 
 *                                the Static Address set by @ref R_BLE_GAP_SetRandAddr() or 
 *                                @ref R_BLE_VS_SetBdAddr() is used. 
 */
#define BLE_ABS_CONN_USE_ADDR_RPA_STATIC    (BLE_GAP_INIT_FILT_USE_ADDR | (BLE_GAP_ADDR_RPA_ID_RANDOM << 4))

/**
 * @def BLE_ABS_CONN_USE_WLST_RPA_STATIC
 * @brief  Filter Policy        : White List is used. \n The remote device registered in White List is connected 
 *                                with local device. \n The p_addr field is ignored. \n 
 *         Local Device Address : Resolvable Private Address. \n
 *                                If the IRK of local device has not been registered in Resolving List, 
 *                                the Static Address set by @ref R_BLE_GAP_SetRandAddr() or 
 *                                @ref R_BLE_VS_SetBdAddr() is used. 
 */
#define BLE_ABS_CONN_USE_WLST_RPA_STATIC    (BLE_GAP_INIT_FILT_USE_WLST | (BLE_GAP_ADDR_RPA_ID_RANDOM << 4))


/******************************************************************************************************************//**
 * @enum e_r_ble_abs_adv_filt_t
 * @brief  Advertising Filter Policy
 **********************************************************************************************************************/
typedef enum
{
    /**
     *  @brief  Receive a connect request from all devices.
     *  @details Defined Value : 0
     */
    BLE_ABS_ADV_ALLOW_CONN_ANY   = 0x00,
    /**
     *  @brief  Receive a connect request from only the devices registered in White List.
     *  @details Defined Value : 3
     */
    BLE_ABS_ADV_ALLOW_CONN_WLST  = 0x03,
} e_r_ble_abs_adv_filt_t;
/*@}*/

/** @defgroup abs_api_struct Structures 
 *  @{
 *  @brief Structure definition
 */
/******************************************************************************************************************//**
 * @struct st_ble_abs_gatts_cb_param_t
 * @brief  st_ble_abs_gatts_cb_param_t includes GATT Server callback function and the priority.
 **********************************************************************************************************************/
typedef struct 
{
    /**
     *  @brief GATT Server callback function to be registered.
     */
    ble_gatts_app_cb_t cb;

    /**
     *  @brief The priority of the callback function. \n
     *         Valid range is 1 <= priority <= @ref BLE_GATTS_MAX_CB. \n
     *         A lower priority number means a higher priority level.
     */
    uint8_t priority;

} st_ble_abs_gatts_cb_param_t;

/******************************************************************************************************************//**
 * @struct st_ble_abs_gatts_init_param_t
 * @brief  st_ble_abs_gatts_init_param_t includes GATT Server callback functions.
 **********************************************************************************************************************/
typedef struct 
{
    /**
     *  @brief The array of the GATT Server callback to be registered.
     */
    st_ble_abs_gatts_cb_param_t * p_cb_param;

    /**
     *  @brief The number of the callback functions provided by the p_cb_param parameter. \n
     *  Valid range is 1 <= cb_num <= @ref BLE_GATTS_MAX_CB.
     */
    uint8_t cb_num;

} st_ble_abs_gatts_init_param_t;

/******************************************************************************************************************//**
 * @struct st_ble_abs_gattc_cb_param_t
 * @brief  st_ble_abs_gattc_cb_param_t includes GATT Client callback function and the priority.
 **********************************************************************************************************************/
typedef struct 
{
    /**
     *  @brief GATT Client callback function to be registered.
     */
    ble_gattc_app_cb_t cb;

    /**
     *  @brief The priority of the callback function. \n
     *         Valid range is 1 <= priority <= @ref BLE_GATTC_MAX_CB. \n
     *         A lower priority number means a higher priority level. 
     */
    uint8_t priority;

