renesas/rx-driver-package/source/r_ble_rx23w/r_ble_rx23w_vx.xx/r_ble_rx23w/src/app_lib/abs/r_ble_abs_api.h
} st_ble_abs_gattc_cb_param_t;

/******************************************************************************************************************//**
 * @struct st_ble_abs_gattc_init_param_t
 * @brief  st_ble_abs_gattc_init_param_t includes GATT Client callback functions.
 **********************************************************************************************************************/
typedef struct 
{
    /**
     *  @brief The array of the GATT Client callback to be registered.
     */
    st_ble_abs_gattc_cb_param_t * p_cb_param;

    /**
     *  @brief The number of the GATT Client callback functions used in an application. \n
        Valid range is 1 <= cb_num <= @ref BLE_GATTC_MAX_CB. \n
        The GATT Discovery Library(app_lib/discovery) registers one callback. \n
        Therefore, set the number of the callback included in the p_cb_param plus one to the cb_num field.
     */
    uint8_t cb_num;

} st_ble_abs_gattc_init_param_t;

/******************************************************************************************************************//**
 * @struct st_ble_abs_pairing_param_t
 * @brief  st_ble_abs_pairing_param_t includes the pairing parameters.
 **********************************************************************************************************************/
typedef struct 
{
    /**
     *  @brief  IO capabilities of local device. \n
     *  Select one of the following.\n
     *  |              macro                   |   description                                                                                                                                     | 
     *  |:------------------------------------ |:------------------------------------------------------------------------------------------------------------------------------------------------- |
     *  | BLE_GAP_IOCAP_DISPLAY_ONLY(0x00)     | Output : Local device has the ability to display a 6 digit decimal number. \n Input : None                                                        | 
     *  | BLE_GAP_IOCAP_DISPLAY_YESNO(0x01)    | Output : Local device has the ability to display a 6 digit decimal number. \n Input : Local device has the ability to indicate 'yes' or 'no'      |
     *  | BLE_GAP_IOCAP_KEYBOARD_ONLY(0x02)    | Output : None. \n Input : Local device has the ability to input the number '0' - '9'.                                                             |
     *  | BLE_GAP_IOCAP_NOINPUT_NOOUTPUT(0x03) | Output : None. \n Input : None.                                                                                                                   |
     *  | BLE_GAP_IOCAP_KEYBOARD_DISPLAY(0x04) | Output : Local device has the ability to display a 6 digit decimal number. \n Input : Local device has the ability to input the number '0' - '9'. |
     */
    uint8_t iocap;

    /**
     *  @brief  MITM protection policy.\n
     *  Select one of the following.
     *    |  macro                                 |   description                                | 
     *    |:---------------------------------------|:-------------------------------------------- |
     *    | BLE_GAP_SEC_MITM_BEST_EFFORT(0x00)     | MITM Protection not required.                | 
     *    | BLE_GAP_SEC_MITM_STRICT(0x01)          | MITM Protection required.                    | 
     */
    uint8_t mitm;

    /**
     *  @brief Determine whether to accept only Secure Connections or not.
     *    |  macro                                 |   description                                  | 
     *    |:---------------------------------------|:---------------------------------------------- |
     *    | BLE_GAP_SC_BEST_EFFORT(0x00)           | Accept Legacy pairing and Secure Connections.  | 
     *    | BLE_GAP_SC_STRICT(0x01)                | Accept only Secure Connections.                | 
     */
    uint8_t sec_conn_only;

    /**
     *  @brief Type of keys to be distributed from local device. \n
     *         The loc_key_dist field is set to a bitwise OR of the following values.
     *    |  macro                                 |   description                                  | 
     *    |:---------------------------------------|:---------------------------------------------- |
     *    | BLE_GAP_KEY_DIST_ENCKEY(0x01)          | LTK                                            |
     *    | BLE_GAP_KEY_DIST_IDKEY(0x02)           | IRK and Identity Address                       |
     *    | BLE_GAP_KEY_DIST_SIGNKEY(0x04)         | CSRK                                           |
     */
    uint8_t loc_key_dist;

    /**
     *  @brief Type of keys which local device requests a remote device to distribute.
     *    |  macro                                 |   description                                                                       | 
     *    |:---------------------------------------|:----------------------------------------------------------------------------------- |
     *    | BLE_GAP_KEY_DIST_ENCKEY(0x01)          | LTK. \n In case of Secure Connections, LTK is notified even if this bit is not set. |
     *    | BLE_GAP_KEY_DIST_IDKEY(0x02)           | IRK and Identity Address                                                            |
     *    | BLE_GAP_KEY_DIST_SIGNKEY(0x04)         | CSRK                                                                                |
     */
    uint8_t rem_key_dist;

    /**
     *  @brief The maximum LTK size(byte) to be requested to a remote device. Valid range is 0x07-0x10. \n
     *         When the LTK size of a remote device is less than max_key_size, the pairing fails. \n
     *         The LTK size of the local device is 16 bytes.
     */
    uint8_t max_key_size;

    /**
     *  @brief padding
     */
    uint8_t padding[2];

} st_ble_abs_pairing_param_t;

/******************************************************************************************************************//**
 * @struct st_ble_abs_init_param_t
 * @brief  st_ble_abs_init_param_t is the parameters for initialization.
 **********************************************************************************************************************/
typedef struct 
{
    /**
     *  @brief GAP callback function to be registered. \n
     *         Note : Host stack initialization requires to register the GAP callback function. 
     */
    ble_gap_app_cb_t gap_cb;

    /**
     *  @brief GATT Server callback functions to be registered. \n
     *         If GATT Server event notification is not needed, specify NULL to the p_gatts_cbs.
     */
    st_ble_abs_gatts_init_param_t * p_gatts_cbs;

    /**
     *  @brief GATT Client callback functions to be registered. \n
     *         If GATT Client event notification is not needed, specify NULL to the p_gattc_cbs.
     */
    st_ble_abs_gattc_init_param_t * p_gattc_cbs;

    /**
     *  @brief Vendor Specific callback function to be registered. \n
     *         If Vendor Specific event notification is not needed, specify NULL to the vs_cb.
     */
    ble_vs_app_cb_t vs_cb;

    /**
     *  @brief Pairing parameters. \n
     *         If pairing parameter configuration is not needed, specify NULL to the p_pair_param.
     */
    st_ble_abs_pairing_param_t * p_pairing_param;

} st_ble_abs_init_param_t;

/******************************************************************************************************************//**
 * @struct st_ble_abs_legacy_adv_param_t
 * @brief  st_ble_abs_legacy_adv_param_t is the parameters for legacy advertising.
 **********************************************************************************************************************/
typedef struct 
{
    /**
     *  @brief The remote device address which has been registered in Resolving List. \n
     *  If the o_addr_type parameter is @ref BLE_GAP_ADDR_RPA_ID_PUBLIC(0x02) or 
     *  @ref BLE_GAP_ADDR_RPA_ID_RANDOM(0x03), \n
     *  set the p_addr parameter to the remote device address which has been registered in Resolving List. \n
     *  If the remote device uses RPA and local device registers the remote device address and the remote IRK in Resolving List,
     *  set the p_addr parameter to the remote device address. \n
     *  If local device and a remote device don't use RPA, set the p_addr parameter to NULL.
     */
    st_ble_dev_addr_t * p_addr;

    /**
     *  @brief Advertising Data. \n
     *  If the p_adv_data is specified as NULL, Advertising Data is not included in the advertising PDU.
     */
    uint8_t * p_adv_data;

    /**
     *  @brief Scan Response Data. \n
     *  If the p_sres_data is specified as NULL, Scan Response Data is not included in the advertising PDU.
     */
    uint8_t * p_sres_data;

    /**
     *  @brief  Advertising with the fast_adv_intv parameter continues for the period specified \n
     *  by the fast_period parameter. \n
     *  Time(ms) = fast_adv_intv * 0.625. \n
     *  If the fast_period parameter is 0, this parameter is ignored.
     *  @note Valid range changes depending on the BLE Protocol Stack library type. \n
     *  All Features        : 0x00000020 - 0x00FFFFFF \n
     *  Balance and Compact : 0x00000020 - 0x00004000 
     */
    uint32_t fast_adv_intv;

    /**
     *  @brief After the elapse of the fast_period, advertising with the slow_adv_intv parameter continues \n
     *  for the period specified by the slow_period parameter. \n
     *  Time(ms) = slow_adv_intv * 0.625.
     *  @note Valid range changes depending on the BLE Protocol Stack library type. \n
     *  All Features        : 0x00000020 - 0x00FFFFFF \n
     *  Balance and Compact : 0x00000020 - 0x00004000 \n
     */
    uint32_t slow_adv_intv;

    /**
     *  @brief The period which advertising with the fast_adv_intv parameter continues for. \n
     *  Time = fast_period * 10ms. \n
     *  After the elapse of the fast_period, @ref BLE_GAP_EVENT_ADV_OFF event notifies that the advertising has stopped.\n
     *  Valid range is 0x0000 - 0xFFFF. \n
     *  If the fast_period parameter is 0x0000, advertising with the fast_adv_intv parameter is not performed.
     */
    uint16_t fast_period;

    /**
     *  @brief The period which advertising with the slow_adv_intv parameter continues for. \n
     *  Time = slow_period * 10ms. \n
     *  After the elapse of the slow_period, @ref BLE_GAP_EVENT_ADV_OFF event notifies that the advertising has stopped. \n
     *  Valid range is 0x0000 - 0xFFFF. \n
     *  If the slow_period parameter is 0x0000, the advertising continues.
     */
    uint16_t slow_period;

    /**
     *  @brief Advertising data length(byte). \n
     *  Valid range is 0-31.  \n
     *  If the adv_data_length is 0, Advertising Data is not included in the advertising PDU.
     */
    uint16_t adv_data_length;

    /**
     *  @brief Scan response data length (in bytes). \n
     *  Scan Response Data(byte). \n
     *  Valid range is 0-31. \n
     *  If the sres_data_length is 0, Scan Response Data is not included in the advertising PDU.
     */
    uint16_t sres_data_length;

    /**
     *  @brief The channel map used for the advertising packet transmission. \n
     *  It is a bitwise OR of the following values.
     *    |  macro                    |   description   | 
     *    |:--------------------------|:--------------- |
     *    | BLE_GAP_ADV_CH_37(0x01)   | Use 37 CH.      | 
     *    | BLE_GAP_ADV_CH_38(0x02)   | Use 38 CH.      | 
     *    | BLE_GAP_ADV_CH_39(0x04)   | Use 38 CH.      | 
     *    | BLE_GAP_ADV_CH_ALL(0x07)  | Use 37 - 39 CH. | 
     */
    uint8_t adv_ch_map;

    /**
     *  @brief Advertising filter policy. \n
     *  If the p_addr parameter is NULL, the advertising is performed according to the advertising filter policy. \n
     *  If the p_addr parameter is not NULL, this parameter is ignored.
     *    |  macro                              |   description                                                             | 
     *    |:------------------------------------|:------------------------------------------------------------------------- |
     *    | BLE_ABS_ADV_ALLOW_CONN_ANY(0x00)    | Process scan and connection requests from all devices.                    | 
     *    | BLE_ABS_ADV_ALLOW_CONN_WLST(0x03)   | Process scan and connection requests from only devices in the White List. | 
     */
    uint8_t filter;

    /**
     *  @brief  Own Bluetooth address type. Select one of the following. \n
     *  If you would like to use RPA, do @ref subsection1 "the local device privacy" procedures. \n
     *  Once you use RPA, the use of RPA is continued in advertising packet, even if the other address type is specified.
     *    |  macro                              |   description                                                                                                                                                  | 
     *    |:------------------------------------|:-------------------------------------------------------------------------------------------------------------------------------------------------------------- |
     *    | BLE_GAP_ADDR_PUBLIC(0x00)           | Public Address                                                                                                                                                 | 
     *    | BLE_GAP_ADDR_RAND(0x01)             | Random Address                                                                                                                                                 | 
     *    | BLE_GAP_ADDR_RPA_ID_PUBLIC(0x02)    | Resolvable Private Address. \n If the IRK of local device has not been registered in Resolving List, public address is used.                                   | 
     *    | BLE_GAP_ADDR_RPA_ID_RANDOM(0x03)    | Resolvable Private Address. \n If the IRK of local device has not been registered in Resolving List, the random address specified by the o_addr field is used. | 
     */
    uint8_t o_addr_type;

    /**
     *  @brief  Random address set to the advertising set, when the o_addr_type field is @ref BLE_GAP_ADDR_RAND or @ref BLE_GAP_ADDR_RPA_ID_RANDOM .\n
     *          When the o_addr_type field is @ref BLE_GAP_ADDR_PUBLIC or @ref BLE_GAP_ADDR_RPA_ID_PUBLIC, this field is ignored. 
     *  @note   If the "Balance" or "Compact" library is used, this field is ignored.
     *          Instead, set the random address (static address or non-resolvable private address) 
     *          by @ref R_BLE_GAP_SetRandAddr() or @ref R_BLE_VS_SetBdAddr(). 
     */
    uint8_t  o_addr[6];

    /**
     *  @brief padding
     */
    uint8_t padding[3];

} st_ble_abs_legacy_adv_param_t;


/******************************************************************************************************************//**
 * @struct st_ble_abs_ext_adv_param_t
 * @brief  st_ble_abs_ext_adv_param_t is the parameters for extended advertising.
 **********************************************************************************************************************/
typedef struct 
{
    /**
     *  @brief The remote device address which has been registered in Resolving List. \n
     *  If the o_addr_type parameter is @ref BLE_GAP_ADDR_RPA_ID_PUBLIC(0x02) or 
     *  @ref BLE_GAP_ADDR_RPA_ID_RANDOM(0x03), \n
     *  set the p_addr parameter to the remote device address which has been registered in Resolving List. \n
     *  If the remote device uses RPA and local device registers the remote device address and the remote IRK in Resolving List,
     *  set the p_addr parameter to the remote device address. \n
     *  If local device and a remote device don't use RPA, set the p_addr parameter to NULL.
     */
    st_ble_dev_addr_t * p_addr;

    /**
     *  @brief Advertising data. If p_adv_data is specified as NULL, advertising data is not set.
     */
    uint8_t * p_adv_data;

    /**
     *  @brief Advertising with the fast_adv_intv parameter continues for \n 
     *  the period specified by the fast_period parameter. \n
     *  Time(ms) = fast_adv_intv * 0.625. \n
     *  If the fast_period parameter is 0, this parameter is ignored. \n
     *  Valid range is 0x00000020 - 0x00FFFFFF.
     */
    uint32_t fast_adv_intv;

    /**
     *  @brief After the elapse of the fast_period, advertising with the slow_adv_intv parameter \n 
     *  continues for the period specified by the slow_period parameter. \n
     *  Time(ms) = slow_adv_intv * 0.625. \n
     *  Valid range is 0x00000020 - 0x00FFFFFF.
     */
    uint32_t slow_adv_intv;

    /**
     *  @brief The period which advertising with the fast_adv_intv parameter continues for. \n
     *  Time = fast_period * 10ms. \n
     *  After the elapse of the fast_period, @ref BLE_GAP_EVENT_ADV_OFF event notifies that the advertising has stopped. \n
     *  Valid range is 0x0000 - 0xFFFF. \n
     *  If the fast_period parameter is 0x0000, the fast_intv parameter is ignored. 
     */
    uint16_t fast_period;

    /**
     *  @brief The period which advertising with the slow_adv_intv parameter continues for. \n
     *  Time = slow_period * 10ms. \n
     *  After the elapse of the slow_period, @ref BLE_GAP_EVENT_ADV_OFF event notifies that the advertising has stopped. \n
     *  Valid range is 0x0000 - 0xFFFF. \n
     *  If the slow_period parameter is 0x0000, the advertising continues.
     */
    uint16_t slow_period;

    /**
     *  @brief Advertising data length (in bytes). \n
     *  Valid range is 0-245. \n
     *  If the adv_data_length is 0, Advertising Data is not included in the advertising PDU.
     */
    uint16_t adv_data_length;

    /**
     *  @brief The channel map used for the advertising packet transmission. \n
     *  It is a bitwise OR of the following values.
     *    |  macro                    |   description   | 
     *    |:--------------------------|:--------------- |
     *    | BLE_GAP_ADV_CH_37(0x01)   | Use 37 CH.      | 
     *    | BLE_GAP_ADV_CH_38(0x02)   | Use 38 CH.      | 
     *    | BLE_GAP_ADV_CH_39(0x04)   | Use 38 CH.      | 
     *    | BLE_GAP_ADV_CH_ALL(0x07)  | Use 37 - 39 CH. | 
     */
    uint8_t adv_ch_map;

    /**
     *  @brief Advertising filter policy. \n
     *  If the p_addr parameter is NULL, the advertising is performed according to the advertising filter policy. \n
     *  If the p_addr parameter is not NULL, this parameter is ignored.
     *    |  macro                              |   description                                                             | 
     *    |:------------------------------------|:------------------------------------------------------------------------- |
     *    | BLE_ABS_ADV_ALLOW_CONN_ANY(0x00)    | Process scan and connection requests from all devices.                    | 
     *    | BLE_ABS_ADV_ALLOW_CONN_WLST(0x03)   | Process scan and connection requests from only devices in the White List. | 
     */
    uint8_t filter;

    /**
     *  @brief  Own Bluetooth address type. Select one of the following. \n
     *  If you would like to use RPA, do @ref subsection1 "the local device privacy" procedures. \n
     *  Once you use RPA, the use of RPA is continued in advertising packet, even if the other address type is specified.
     *    |  macro                              |   description                                                                                                                                                  | 
     *    |:------------------------------------|:-------------------------------------------------------------------------------------------------------------------------------------------------------------- |
     *    | BLE_GAP_ADDR_PUBLIC(0x00)           | Public Address                                                                                                                                                 | 
     *    | BLE_GAP_ADDR_RAND(0x01)             | Random Address                                                                                                                                                 | 
     *    | BLE_GAP_ADDR_RPA_ID_PUBLIC(0x02)    | Resolvable Private Address. \n If the IRK of local device has not been registered in Resolving List, public address is used.                                   | 
     *    | BLE_GAP_ADDR_RPA_ID_RANDOM(0x03)    | Resolvable Private Address. \n If the IRK of local device has not been registered in Resolving List, the random address specified by the o_addr field is used. | 
     */
    uint8_t o_addr_type;

    /**
     *  @brief Primary ADV PHY. \n
     *  In this parameter, only 1M PHY and Coded PHY can be specified, and 2M PHY cannot be specified. 
     *    |  macro                   |   description                                                                                                                                        | 
     *    |:-------------------------|:---------------------------------------------------------------------------------------------------------------------------------------------------- |
     *    | BLE_GAP_ADV_PHY_1M(0x01) | Use 1M PHY as Primary Advertising PHY. \n When the adv_prop_type field is Legacy Advertising PDU type, this field shall be set to BLE_GAP_ADV_PHY_1M.| 
     *    | BLE_GAP_ADV_PHY_CD(0x03) | Use Coded PHY as Primary Advertising PHY. \n Coding scheme is configured by @ref R_BLE_VS_SetCodingScheme().                                         | 
     */
    uint8_t adv_phy;

    /**
     *  @brief  Secondary ADV Phy. Select one of the following.
     *    |  macro                     |   description                                                                                                       | 
     *    |:---------------------------|:------------------------------------------------------------------------------------------------------------------- |
     *    | BLE_GAP_ADV_PHY_1M(0x01)   | Use 1M PHY as Secondary Advertising PHY.                                                                            | 
     *    | BLE_GAP_ADV_PHY_2M(0x02)   | Use 2M PHY as Secondary Advertising PHY.                                                                            | 
     *    | BLE_GAP_ADV_PHY_CD(0x03)   | Use Coded PHY(S=8) as Secondary Advertising PHY. \n Coding scheme is configured by @ref R_BLE_VS_SetCodingScheme(). |
     */
    uint8_t sec_adv_phy;

    /**
     *  @brief  Random address set to the advertising set, when the o_addr_type field is @ref BLE_GAP_ADDR_RAND or @ref BLE_GAP_ADDR_RPA_ID_RANDOM.\n
     *          When the o_addr_type field is @ref BLE_GAP_ADDR_PUBLIC or @ref BLE_GAP_ADDR_RPA_ID_PUBLIC, this field is ignored. 
     *  @note   If the "Balance" or "Compact" library is used, this field is ignored.
     *          Instead, set the random address (static address or non-resolvable private address) 
     *          by @ref R_BLE_GAP_SetRandAddr() or @ref R_BLE_VS_SetBdAddr(). 
     */
    uint8_t  o_addr[6];

    /**
     *  @brief padding
     */
    uint8_t padding[3];

} st_ble_abs_ext_adv_param_t;

