renesas/rx-driver-package/source/r_ble_rx23w/r_ble_rx23w_vx.xx/r_ble_rx23w/src/app_lib/abs/r_ble_abs_api.h
/******************************************************************************************************************//**
 * @struct st_ble_abs_non_conn_adv_param_t
 * @brief  st_ble_abs_non_conn_adv_param_t is the parameters for non-connectable advertising.
 **********************************************************************************************************************/
typedef struct 
{
    /**
     *  @brief The remote device address which has been registered in Resolving List. \n
     *  If the o_addr_type parameter is @ref BLE_GAP_ADDR_RPA_ID_PUBLIC(0x02) or 
     *  @ref BLE_GAP_ADDR_RPA_ID_RANDOM(0x03), \n
     *  set the p_addr parameter to the remote device address which has been registered in Resolving List. \n
     *  If the remote device uses RPA and local device registers the remote device address and the remote IRK in Resolving List,
     *  set the p_addr parameter to the remote device address. \n
     *  If local device and a remote device don't use RPA, set the p_addr parameter to NULL.
     */
    st_ble_dev_addr_t * p_addr;

    /**
     *  @brief Advertising data. If p_adv_data is specified as NULL, advertising data is not set.
     */
    uint8_t * p_adv_data;

    /**
     *  @brief Advertising with the adv_intv parameter continues for the period specified by the duration parameter.\n
     *  Time(ms) = fast_adv_intv * 0.625. \n
     *  If the duration parameter is 0x0000, the advertising with the adv_intv parameter continue.
     *  @note Valid range changes depending on the BLE Protocol Stack library type. \n
     *  All Features        : 0x00000020 - 0x00FFFFFF \n
     *  Balance and Compact : 0x00000020 - 0x00004000 \n
     */
    uint32_t adv_intv;

    /**
     *  @brief The period which advertising with the adv_intv parameter continues for. \n
     *  Time = duration * 10ms.\n
     *  After the elapse of the duration, @ref BLE_GAP_EVENT_ADV_OFF event notifies that the advertising has stopped. \n
     *  Valid range is 0x0000 - 0xFFFF. \n
     *  If the duration parameter is 0x0000, the advertising continues.
     */
    uint16_t duration;

    /**
     *  @brief Advertising data length (in bytes).\n
     *  If the adv_phy parameter is @ref BLE_ABS_ADV_PHY_LEGACY(0x00), the valid range is 0-31. \n
     *  If the adv_phy parameter is the other values, the valid range is 0-1650. \n
     *  If the adv_data_length parameter is 0, Advertising Data is not included in the advertising PDU.
     *
     *  @note   If the "Balance" or "Compact" library is used, the valid range is 0-31.
     *
     */
    uint16_t adv_data_length;

    /**
     *  @brief The channel map used for the advertising packet transmission.
     *  It is a bitwise OR of the following values.
     *    |  macro                    |   description   | 
     *    |:--------------------------|:--------------- |
     *    | BLE_GAP_ADV_CH_37(0x01)   | Use 37 CH.      | 
     *    | BLE_GAP_ADV_CH_38(0x02)   | Use 38 CH.      | 
     *    | BLE_GAP_ADV_CH_39(0x04)   | Use 38 CH.      | 
     *    | BLE_GAP_ADV_CH_ALL(0x07)  | Use 37 - 39 CH. | 
     */
    uint8_t adv_ch_map;

    /**
     *  @brief  Own Bluetooth address type. Select one of the following. \n
     *  If you would like to use RPA, do @ref subsection1 "the local device privacy" procedures. \n
     *  Once you use RPA, the use of RPA is continued in advertising packet, even if the other address type is specified.
     *    |  macro                              |   description                                                                                                                                                  | 
     *    |:------------------------------------|:-------------------------------------------------------------------------------------------------------------------------------------------------------------- |
     *    | BLE_GAP_ADDR_PUBLIC(0x00)           | Public Address                                                                                                                                                 | 
     *    | BLE_GAP_ADDR_RAND(0x01)             | Random Address                                                                                                                                                 | 
     *    | BLE_GAP_ADDR_RPA_ID_PUBLIC(0x02)    | Resolvable Private Address. \n If the IRK of local device has not been registered in Resolving List, public address is used.                                   | 
     *    | BLE_GAP_ADDR_RPA_ID_RANDOM(0x03)    | Resolvable Private Address. \n If the IRK of local device has not been registered in Resolving List, the random address specified by the o_addr field is used. | 
     */
    uint8_t o_addr_type;

    /**
     *  @brief Primary ADV PHY. \n
     *  In this parameter, only 1M PHY and Coded PHY can be specified, and 2M PHY cannot be specified. 
     *    |  macro                       |   description                                                                                                                                                             | 
     *    |:-----------------------------|:------------------------------------------------------------------------------------------------------------------------------------------------------------------------- |
     *    | BLE_ABS_ADV_PHY_LEGACY(0x00) | Use 1M PHY as Primary Advertising PHY for Non-Connectable Legacy Advertising. \n If Periodic Advertising is performed, this value shall not set to the adv_phy parameter. | 
     *    | BLE_GAP_ADV_PHY_1M(0x01)     | Use 1M PHY as Primary Advertising PHY. \n When the adv_prop_type field is Legacy Advertising PDU type, this field shall be set to BLE_GAP_ADV_PHY_1M.                     | 
     *    | BLE_GAP_ADV_PHY_CD(0x03)     | Use Coded PHY as Primary Advertising PHY. \n Coding scheme is configured by @ref R_BLE_VS_SetCodingScheme().                                                              | 
     *
     *  @note   If the "Balance" or "Compact" library is used, this field is ignored.
     */
    uint8_t adv_phy;

    /**
     *  @brief  Secondary ADV Phy. Select one of the following.
     *    |  macro                     |   description                                                                                                       | 
     *    |:---------------------------|:------------------------------------------------------------------------------------------------------------------- |
     *    | BLE_GAP_ADV_PHY_1M(0x01)   | Use 1M PHY as Secondary Advertising PHY.                                                                            | 
     *    | BLE_GAP_ADV_PHY_2M(0x02)   | Use 2M PHY as Secondary Advertising PHY.                                                                            | 
     *    | BLE_GAP_ADV_PHY_CD(0x03)   | Use Coded PHY(S=8) as Secondary Advertising PHY. \n Coding scheme is configured by @ref R_BLE_VS_SetCodingScheme(). |
     *
     *  @note   If the "Balance" or "Compact" library is used, this field is ignored.
     */
    uint8_t sec_adv_phy;

    /**
     *  @brief  Random address set to the advertising set, when the o_addr_type field is @ref BLE_GAP_ADDR_RAND or @ref BLE_GAP_ADDR_RPA_ID_RANDOM.\n
     *          When the o_addr_type field is @ref BLE_GAP_ADDR_PUBLIC or @ref BLE_GAP_ADDR_RPA_ID_PUBLIC, this field is ignored. 
     *  @note   If the "Balance" or "Compact" library is used, this field is ignored.
     *          Instead, set the random address (static address or non-resolvable private address) 
     *          by @ref R_BLE_GAP_SetRandAddr() or @ref R_BLE_VS_SetBdAddr(). 
     */
    uint8_t  o_addr[6];

    /**
     *  @brief padding
     */
    uint8_t padding[2];

} st_ble_abs_non_conn_adv_param_t;


/******************************************************************************************************************//**
 * @struct st_ble_abs_perd_adv_param_t
 * @brief  st_ble_abs_perd_adv_param_t is the parameters for periodic advertising.
 **********************************************************************************************************************/
typedef struct 
{
    /**
     *  @brief Advertising parameters.
     */
    st_ble_abs_non_conn_adv_param_t param;

    /**
     *  @brief Periodic advertising data. If p_perd_adv_data is specified as NULL, periodic advertising data is not set.
     */
    uint8_t * p_perd_adv_data;

    /**
     *  @brief Periodic advertising interval. \n 
     *  Time(ms) = perd_intv_min * 1.25. \n 
     *  Valid range is 0x0006 - 0xFFFF.
     */
    uint16_t perd_intv;

    /**
     *  @brief Periodic advertising data length (in bytes). \n
     *  Valid range is 0 - 1650. \n
     *  If the perd_adv_data_length is 0, Periodic Advertising Data is not included in the advertising PDU.
     */
    uint16_t perd_adv_data_length;

