renesas/rx-driver-package/source/r_ble_rx23w/r_ble_rx23w_vx.xx/r_ble_rx23w/src/app_lib/abs/r_ble_abs_api.h
} st_ble_abs_perd_adv_param_t;

/******************************************************************************************************************//**
 * @struct st_ble_abs_scan_phy_param_t
 * @brief  st_ble_abs_scan_phy_param_t is the phy parameters for scan.
 **********************************************************************************************************************/
typedef struct 
{
    /**
     *  @brief Fast scan interval. \n 
     *  Interval(ms) = fast_intv * 0.625. 
     *  
     *  @note Valid range changes depending on the BLE Protocol Stack library type. \n
     *  All Features        : 0x0004 - 0xFFFF \n
     *  Balance             : 0x0004 - 0x4000 \n
     *  
     */
    uint16_t fast_intv;

    /**
     *  @brief Slow Scan interval. \n
     *  Slow Scan interval(ms) = slow_intv * 0.625.
     *  
     *  @note Valid range changes depending on the BLE Protocol Stack library type. \n
     *  All Features        : 0x0004 - 0xFFFF \n
     *  Balance             : 0x0004 - 0x4000 \n
     */
    uint16_t slow_intv;

    /**
     *  @brief Fast Scan window. \n
     *  Fast Scan window(ms) = fast_window * 0.625.
     *  
     *  @note Valid range changes depending on the BLE Protocol Stack library type. \n
     *  All Features        : 0x0004 - 0xFFFF \n
     *  Balance             : 0x0004 - 0x4000 \n
     */
    uint16_t fast_window;

    /**
     *  @brief Slow Scan window. \n
     *  Slow Scan window(ms) = slow_window * 0.625.
     *  
     *  @note Valid range changes depending on the BLE Protocol Stack library type. \n
     *  All Features        : 0x0004 - 0xFFFF \n
     *  Balance             : 0x0004 - 0x4000 \n
     */
    uint16_t slow_window;

    /**
     *  @brief Scan type.
     *    |  macro                       |   description   | 
     *    |:-----------------------------|:--------------- |
     *    | BLE_GAP_SCAN_PASSIVE(0x00)   | Passive Scan.   | 
     *    | BLE_GAP_SCAN_ACTIVE(0x01)    | Active Scan.    | 
     */
    uint8_t scan_type;

    /**
     *  @brief padding.
     */
    uint8_t padding[3];

} st_ble_abs_scan_phy_param_t;

/******************************************************************************************************************//**
 * @struct st_ble_abs_scan_param_t
 * @brief  st_ble_abs_scan_param_t is the parameters for scan.
 **********************************************************************************************************************/
typedef struct 
{
    /**
     *  @brief Scan parameters for receiving the advertising packets in 1M PHY. \n
     *  In case of not receiving the advertising packets in 1M PHY, this field is specified as NULL. \n
     *  p_phy_param_1M or p_phy_param_coded field shall be set to scan parameters.
     */
    st_ble_abs_scan_phy_param_t * p_phy_param_1M;

    /**
     *  @brief Scan parameters for receiving the advertising packets in Coded PHY. \n
     *  In case of not receiving the advertising packets in Coded PHY, this field is specified as NULL. \n
     *  p_phy_param_1M or p_phy_param_coded field shall be set to scan parameters.
     */
    st_ble_abs_scan_phy_param_t * p_phy_param_coded;

    /**
     *  @brief Data for Advertising Data filtering. \n
     *  The p_filter_data parameter is used for the advertising data in single advertising report. \n
     *  The advertising data composed of multiple advertising reports is not filtered by this parameter. \n
     *  If the p_filter_data parameter is specified as NULL, the filtering is not done.
     */
    uint8_t * p_filter_data;

    /**
     *  @brief The period which scan with the fast scan interval/fast scan window continues for. \n
     *  Time(ms) = fast_period * 10. \n
     *  Valid range is 0x0000 - 0xFFFF. \n
     *  If the fast_period parameter is 0x0000, scan with the fast scan interval/fast scan window is not performed. \n
     *  After the elapse of the fast_period, @ref BLE_GAP_EVENT_SCAN_TO event notifies that the scan has stopped.
     */
    uint16_t fast_period;

    /**
     *  @brief The period which scan with the slow scan interval/slow scan window continues for. \n
     *  Time = slow_period * 10ms. \n
     *  Valid range is 0x0000 - 0xFFFF. \n
     *  If the slow_period parameter is 0x0000, the scan continues. \n
     *  After the elapse of the slow_period, @ref BLE_GAP_EVENT_SCAN_TO event notifies that the scan has stopped.
     */
    uint16_t slow_period;

    /**
     *  @brief The length of the data specified by the p_filter_data parameter. \n
     *  Valid range is 0x0000-0x0010. \n
     *  If the filter_data_length parameter is 0, the filtering is not done.
     */
    uint16_t filter_data_length;

    /**
     *  @brief Scan Filter Policy and Local Device Address Type. Select one of the following.
     *         If you would like to use RPA, do @ref subsection1 "the local device privacy" procedures. \n
     *         Once you use RPA, the use of RPA is continued in scan request packet, even if the other address type is specified. 
     *  <table>
     *      <tr>
     *          <th>macro</th>
     *          <th>description</th>
     *      </tr>
     *      <tr>
     *          <td> @ref BLE_ABS_SCAN_ALL_PUBLIC ( @ref BLE_GAP_SCAN_ALLOW_ADV_ALL | 
     *               ( @ref BLE_GAP_ADDR_PUBLIC << 4))</td>
     *          <td><b><span style="color:#307D7E">Address Type</span></b> : Public Address \n 
     *              <b><span style="color:#307D7E">Filter</span></b> : Accept all advertising and scan response PDUs 
     *              except directed advertising PDUs not addressed to local device.</td>
     *      </tr>
     *      <tr>
     *          <td> @ref BLE_ABS_SCAN_WLST_PUBLIC (( @ref BLE_GAP_SCAN_ALLOW_ADV_WLST | 
     *              ( @ref BLE_GAP_ADDR_PUBLIC << 4)))</td>
     *          <td><b><span style="color:#307D7E">Address Type</span></b> : Public Address \n 
     *              <b><span style="color:#307D7E">Filter</span></b> : Accept only advertising and scan response PDUs 
     *              from remote devices whose address is registered in the White List. 
     *              Directed advertising PDUs which are not addressed to local device is ignored.</td>
     *      </tr>
     *      <tr>
     *          <td> @ref BLE_ABS_SCAN_EXC_DIR_PUBLIC ( @ref BLE_GAP_SCAN_ALLOW_ADV_EXCEPT_DIRECTED | 
     *              ( @ref BLE_GAP_ADDR_PUBLIC << 4))</td>
     *          <td><b><span style="color:#307D7E">Address Type</span></b> : Public Address \n 
     *              <b><span style="color:#307D7E">Filter</span></b> : Accept all advertising and scan response PDUs 
     *              except directed advertising PDUs whose the target address is identity address but doesn't address 
     *              local device. 
     *              However directed advertising PDUs whose the target address is the local resolvable private address 
     *              are accepted.</td>
     *      </tr>
     *      <tr>
     *          <td> @ref BLE_ABS_SCAN_EXC_DIR_WLST_PUBLIC (( @ref BLE_GAP_SCAN_ALLOW_ADV_EXCEPT_DIRECTED_WLST | 
     *              ( @ref BLE_GAP_ADDR_PUBLIC << 4)))</td>
     *          <td><b><span style="color:#307D7E">Address Type</span></b> : Public Address \n 
     *              <b><span style="color:#307D7E">Filter</span></b> : Accept all advertising and scan response PDUs. 
     *              The following are excluded. \n 
     *              \arg Advertising and scan response PDUs where the advertiser's identity address is not 
     *              in the White List. \n \arg Directed advertising PDUs whose the target address is identity address 
     *              but doesn't address local device. However directed advertising PDUs whose the target address is 
     *              the local resolvable private address are accepted.</td>
     *      </tr>
     *      <tr>
     *          <td> @ref BLE_ABS_SCAN_ALL_STATIC ( @ref BLE_GAP_SCAN_ALLOW_ADV_ALL | 
     *              ( @ref BLE_GAP_ADDR_RAND << 4))</td>
     *          <td><b><span style="color:#307D7E">Address Type</span></b> : Static Address \n 
     *              <b><span style="color:#307D7E">Filter</span></b> : Accept all advertising and scan response PDUs 
     *              except directed advertising PDUs not addressed to local device.</td>
     *      </tr>
     *      <tr>
     *          <td> @ref BLE_ABS_SCAN_WLST_STATIC ( @ref BLE_GAP_SCAN_ALLOW_ADV_WLST | 
     *              ( @ref BLE_GAP_ADDR_RAND << 4))</td>
     *          <td><b><span style="color:#307D7E">Address Type</span></b> : Static Address \n 
     *              <b><span style="color:#307D7E">Filter</span></b> : Accept only advertising and scan response PDUs 
     *              from remote devices whose address is registered in the White List. 
     *              Directed advertising PDUs which are not addressed to local device is ignored.</td>
     *      </tr>
     *      <tr>
     *          <td> @ref BLE_ABS_SCAN_EXC_DIR_STATIC ( @ref BLE_GAP_SCAN_ALLOW_ADV_EXCEPT_DIRECTED | 
     *              ( @ref BLE_GAP_ADDR_RAND << 4))</td>
     *          <td><b><span style="color:#307D7E">Address Type</span></b> : Static Address \n 
     *              <b><span style="color:#307D7E">Filter</span></b> : Accept all advertising and scan response PDUs 
     *              except directed advertising PDUs whose the target address is identity address but doesn't address 
     *              local device. 
     *              However directed advertising PDUs whose the target address is the local resolvable private address 
     *              are accepted.</td>
     *      </tr>
     *      <tr>
     *          <td> @ref BLE_ABS_SCAN_EXC_DIR_WLST_STATIC ( @ref BLE_GAP_SCAN_ALLOW_ADV_EXCEPT_DIRECTED_WLST | 
     *              ( @ref BLE_GAP_ADDR_RAND << 4))</td>
     *          <td><b><span style="color:#307D7E">Address Type</span></b> : Static Address \n 
     *              <b><span style="color:#307D7E">Filter</span></b> : Accept all advertising and scan response PDUs. 
     *              The following are excluded. \n 
     *              \arg Advertising and scan response PDUs where the advertiser's identity address is not 
     *              in the White List. \n \arg Directed advertising PDUs whose the target address is identity address 
     *              but doesn't address local device. However directed advertising PDUs whose the target address is 
     *              the local resolvable private address are accepted.</td>
     *      </tr>
     *      <tr>
     *          <td> @ref BLE_ABS_SCAN_ALL_RPA_PUBLIC ( @ref BLE_GAP_SCAN_ALLOW_ADV_ALL | 
     *              ( @ref BLE_GAP_ADDR_RPA_ID_PUBLIC << 4))</td>
     *          <td><b><span style="color:#307D7E">Address Type</span></b> : Resolvable Private Address. 
     *              If the IRK of local device has not been registered in Resolving List, Public Address is used. \n 
     *              <b><span style="color:#307D7E">Filter</span></b> : Accept all advertising and scan response PDUs 
     *              except directed advertising PDUs not addressed to local device.</td>
     *      </tr>
     *      <tr>
     *          <td> @ref BLE_ABS_SCAN_WLST_RPA_PUBLIC ( @ref BLE_GAP_SCAN_ALLOW_ADV_WLST | 
     *              ( @ref BLE_GAP_ADDR_RPA_ID_PUBLIC << 4))</td>
     *          <td><b><span style="color:#307D7E">Address Type</span></b> : Resolvable Private Address. 
     *              If the IRK of local device has not been registered in Resolving List, Public Address is used. \n 
     *              <b><span style="color:#307D7E">Filter</span></b> : Accept only advertising and scan response PDUs 
     *              from remote devices whose address is registered in the White List. 
     *              Directed advertising PDUs which are not addressed to local device is ignored.</td>
     *      </tr>
     *      <tr>
     *          <td> @ref BLE_ABS_SCAN_EXC_DIR_RPA_PUBLIC ( @ref BLE_GAP_SCAN_ALLOW_ADV_EXCEPT_DIRECTED | 
     *              ( @ref BLE_GAP_ADDR_RPA_ID_PUBLIC << 4))</td>
     *          <td><b><span style="color:#307D7E">Address Type</span></b> : Resolvable Private Address. 
     *              If the IRK of local device has not been registered in Resolving List, Public Address is used. \n 
     *              <b><span style="color:#307D7E">Filter</span></b> : Accept all advertising and scan response PDUs 
     *              except directed advertising PDUs whose the target address is identity address but doesn't address 
     *              local device. 
     *              However directed advertising PDUs whose the target address is the local resolvable private address 
     *              are accepted.</td>
     *      </tr>
     *      <tr>
     *          <td> @ref BLE_ABS_SCAN_EXC_DIR_WLST_RPA_PUBLIC ( @ref BLE_GAP_SCAN_ALLOW_ADV_EXCEPT_DIRECTED_WLST | 
     *              ( @ref BLE_GAP_ADDR_RPA_ID_PUBLIC << 4))</td>
     *          <td><b><span style="color:#307D7E">Address Type</span></b> : Resolvable Private Address. 
     *              If the IRK of local device has not been registered in Resolving List, Public Address is used. \n 
     *              <b><span style="color:#307D7E">Filter</span></b> : Accept all advertising and scan response PDUs. 
     *              The following are excluded. \n 
     *              \arg Advertising and scan response PDUs where the advertiser's identity address is not 
     *              in the White List. \n \arg Directed advertising PDUs whose the target address is identity address 
     *              but doesn't address local device. However directed advertising PDUs whose the target address is 
     *              the local resolvable private address are accepted.</td>
     *      </tr>
     *      <tr>
     *          <td> @ref BLE_ABS_SCAN_ALL_RPA_STATIC ( @ref BLE_GAP_SCAN_ALLOW_ADV_ALL | 
     *              ( @ref BLE_GAP_ADDR_RPA_ID_RANDOM << 4))</td>
     *          <td><b><span style="color:#307D7E">Address Type</span></b> : Resolvable Private Address. 
     *              If the IRK of local device has not been registered in Resolving List, the Static Address set 
     *              by @ref R_BLE_GAP_SetRandAddr() or @ref R_BLE_VS_SetBdAddr() is used. \n 
     *              <b><span style="color:#307D7E">Filter</span></b> : Accept all advertising and scan response PDUs 
     *              except directed advertising PDUs not addressed to local device.</td>
     *      </tr>
     *      <tr>
     *          <td> @ref BLE_ABS_SCAN_WLST_RPA_STATIC ( @ref BLE_GAP_SCAN_ALLOW_ADV_WLST | 
     *              ( @ref BLE_GAP_ADDR_RPA_ID_RANDOM << 4))</td>
     *          <td><b><span style="color:#307D7E">Address Type</span></b> : Resolvable Private Address. 
     *              If the IRK of local device has not been registered in Resolving List, the Static Address set 
     *              by @ref R_BLE_GAP_SetRandAddr() or @ref R_BLE_VS_SetBdAddr() is used. \n 
     *              <b><span style="color:#307D7E">Filter</span></b> : Accept only advertising and scan response PDUs 
     *              from remote devices whose address is registered in the White List. 
     *              Directed advertising PDUs which are not addressed to local device is ignored.</td>
     *      </tr>
     *      <tr>
     *          <td> @ref BLE_ABS_SCAN_EXC_DIR_RPA_STATIC ( @ref BLE_GAP_SCAN_ALLOW_ADV_EXCEPT_DIRECTED | 
     *              ( @ref BLE_GAP_ADDR_RPA_ID_RANDOM << 4))</td>
     *          <td><b><span style="color:#307D7E">Address Type</span></b> : Resolvable Private Address. 
     *              If the IRK of local device has not been registered in Resolving List, the Static Address set 
     *              by @ref R_BLE_GAP_SetRandAddr() or @ref R_BLE_VS_SetBdAddr() is used. \n 
     *              <b><span style="color:#307D7E">Filter</span></b> : Accept all advertising and scan response PDUs 
     *              except directed advertising PDUs whose the target address is identity address but doesn't address 
     *              local device. 
     *              However directed advertising PDUs whose the target address is the local resolvable private address 
     *              are accepted.</td>
     *          </td>
     *      </tr>
     *      <tr>
     *          <td> @ref BLE_ABS_SCAN_EXC_DIR_WLST_RPA_STATIC ( @ref BLE_GAP_SCAN_ALLOW_ADV_EXCEPT_DIRECTED_WLST | 
     *              ( @ref BLE_GAP_ADDR_RPA_ID_RANDOM << 4))</td>
     *          <td><b><span style="color:#307D7E">Address Type</span></b> : Resolvable Private Address. 
     *              If the IRK of local device has not been registered in Resolving List, the Static Address set 
     *              by @ref R_BLE_GAP_SetRandAddr() or @ref R_BLE_VS_SetBdAddr() is used. \n 
     *              <b><span style="color:#307D7E">Filter</span></b> : Accept all advertising and scan response PDUs. 
     *              The following are excluded. \n 
     *              \arg Advertising and scan response PDUs where the advertiser's identity address is not 
     *              in the White List. \n \arg Directed advertising PDUs whose the target address is identity address 
     *              but doesn't address local device. However directed advertising PDUs whose the target address is 
     *              the local resolvable private address are accepted.</td>
     *          </td>
     *      </tr>
     *  </table>
     */
    uint8_t dev_filter;

    /**
     *  @brief Filter duplicates. \n
     *  Maximum number of filtered devices is 8. \n
     *  The 9th and subsequent devices are not filtered by this parameter. 
     *    |  macro                                            |   description                                            | 
     *    |:--------------------------------------------------|:-------------------------------------------------------- |
     *    | BLE_GAP_SCAN_FILT_DUPLIC_DISABLE(0x00)            | Duplicate filter disabled.                               | 
     *    | BLE_GAP_SCAN_FILT_DUPLIC_ENABLE(0x01)             | Duplicate filter enabled.                                | 
     *    | BLE_GAP_SCAN_FILT_DUPLIC_ENABLE_FOR_PERIOD(0x02)) | Duplicate filtering enabled, reset for each scan period. | 
     */
    uint8_t filter_dups;

    /**
     *  @brief The AD type of the data specified by the p_filter_data parameter.\n
     *  The AD type identifier values are defined in Bluetooth SIG Assigned Number \n
     *  (https://www.bluetooth.com/specifications/assigned-numbers).\n
     *  If this parameter is set to 0, the scanner device retrieves an AD Data having a data forward coinciding 
     *  with the data specified by the p_filter_data parameter.
     */
    uint8_t filter_ad_type;

    /**
     *  @brief Padding
     */
    uint8_t padding[3];

