renesas/rx-driver-package/source/r_ble_rx23w/r_ble_rx23w_vx.xx/r_ble_rx23w/src/app_lib/abs/r_ble_abs_api.h
} st_ble_abs_scan_param_t;


/******************************************************************************************************************//**
 * @struct st_ble_abs_conn_phy_param_t
 * @brief  st_ble_abs_conn_phy_param_t is the phy parameters for create connection.
 **********************************************************************************************************************/
typedef struct 
{
    /**
     *  @brief Connection interval. \n
     *  Time(ms) = conn_intv_min * 1.25. \n
     *  Valid range is 0x0006 - 0x0C80.
     */
    uint16_t conn_intv;

    /**
     *  @brief Slave latency. \n 
     *  Valid range is 0x0000 - 0x01F3.
     */
    uint16_t conn_latency;

    /**
     *  @brief Supervision timeout. \n
     *  Time(ms) = sup_to * 10. \n
     *  Valid range is 0x000A - 0x0C80.
     */
    uint16_t sup_to;

    /**
     *  @brief Padding
     */
    uint8_t padding[2];

} st_ble_abs_conn_phy_param_t;


/******************************************************************************************************************//**
 * @struct st_ble_abs_conn_param_t
 * @brief  st_ble_abs_conn_param_t is the parameters for create connection.
 **********************************************************************************************************************/
typedef struct 
{
    /**
     *  @brief Connection interval, slave latency, supervision timeout for 1M PHY. \n
     *  The p_conn_1M is specified as NULL, a connection request is not sent with 1M PHY.
     */
    st_ble_abs_conn_phy_param_t * p_conn_1M;

    /**
     *  @brief Connection interval, slave latency, supervision timeout for 2M PHY. \n 
     *  The p_conn_2M is specified as NULL, a connection request is not sent with 2M PHY. 
     */
    st_ble_abs_conn_phy_param_t * p_conn_2M;

    /**
     *  @brief Connection interval, slave latency, supervision timeout for Coded PHY.  \n
     *  The p_conn_coded is specified as NULL, a connection request is not sent with Coded PHY.
     */
    st_ble_abs_conn_phy_param_t * p_conn_coded;

    /**
     *  @brief Address of the device to be connected. \n 
     *  The type field in the p_addr parameter is set to one of the following values.
     * 
     * |  The type field value     |   description                                        | 
     * |:------------------------- |:---------------------------------------------------- |
     * | BLE_GAP_ADDR_PUBLIC(0x00) | Public Address or Public Identity Address            | 
     * | BLE_GAP_ADDR_RAND(0x01)   | Random Address or Random (Static) Identity Address   | 
     * 
     *  If the filter field is @ref BLE_GAP_INIT_FILT_USE_WLST(0x01), this parameter is ignored.
     */
    st_ble_dev_addr_t * p_addr;

    /**
     *  @brief The filter configuration and the local device address type. \n
     *         The filter configuration specifies whether the White List is used or not, 
     *         when connecting with a remote device.\n
     *         If you would like to use RPA, do @ref subsection1 "the local device privacy" procedures. \n
     *         Once you use RPA, the use of RPA is continued in connection request packet, even if the other address type is specified. \n
     *         If local device and the remote device don't use RPA, <br/>
     *         the @ref st_ble_abs_conn_param_t::p_addr "p_addr" field is ignored. \n
     *         If local device uses RPA and registers the IRK in Resolving List and uses the White List, \n
     *         the address in Resolving List needs to be specified by the @ref st_ble_abs_conn_param_t::p_addr "p_addr" field. \n
     *         If the remote device uses RPA and local device registers the remote IRK in Resolving List, \n
     *         the remote address in Resolving List needs to be specified by the @ref st_ble_abs_conn_param_t::p_addr "p_addr" field.
     *  <table>
     *      <tr>
     *          <th>macro</th>
     *          <th>description</th>
     *      </tr>
     *      <tr>
     *          <td> @ref BLE_ABS_CONN_USE_ADDR_PUBLIC ( @ref BLE_GAP_INIT_FILT_USE_ADDR | 
     *               ( @ref BLE_GAP_ADDR_PUBLIC << 4))</td>
     *          <td><b><span style="color:#307D7E">Address Type</span></b> : Public Address \n 
     *              <b><span style="color:#307D7E">Filter</span></b> : White List is not used. 
     *              The remote device to be connected is specified by the remote device address parameter is used. </td>
     *      </tr>
     *      <tr>
     *          <td> @ref BLE_ABS_CONN_USE_WLST_PUBLIC ( @ref BLE_GAP_INIT_FILT_USE_WLST | 
     *               ( @ref BLE_GAP_ADDR_PUBLIC << 4))</td>
     *          <td><b><span style="color:#307D7E">Address Type</span></b> : Public Address \n 
     *              <b><span style="color:#307D7E">Filter</span></b> : White List is used. 
     *              The remote device registered in White List is connected 
     *              with local device. \n The remote device address parameter is ignored.  </td>
     *      </tr>
     *      <tr>
     *          <td> @ref BLE_ABS_CONN_USE_ADDR_STATIC ( @ref BLE_GAP_INIT_FILT_USE_ADDR | 
     *               ( @ref BLE_GAP_ADDR_RAND << 4))</td>
     *          <td><b><span style="color:#307D7E">Address Type</span></b> : Static Address \n 
     *              <b><span style="color:#307D7E">Filter</span></b> : White List is not used. 
     *              The remote device to be connected is specified by the remote device address parameter is used. </td>
     *      </tr>
     *      <tr>
     *          <td> @ref BLE_ABS_CONN_USE_WLST_STATIC ( @ref BLE_GAP_INIT_FILT_USE_WLST | 
     *               ( @ref BLE_GAP_ADDR_RAND << 4))</td>
     *          <td><b><span style="color:#307D7E">Address Type</span></b> : Static Address \n 
     *              <b><span style="color:#307D7E">Filter</span></b> : White List is used. 
     *              The remote device registered in White List is connected 
     *              with local device. \n The remote device address parameter is ignored.  </td>
     *      </tr>
     *      <tr>
     *          <td> @ref BLE_ABS_CONN_USE_ADDR_RPA_PUBLIC ( @ref BLE_GAP_INIT_FILT_USE_ADDR | 
     *               ( @ref BLE_GAP_ADDR_RPA_ID_PUBLIC << 4))</td>
     *          <td><b><span style="color:#307D7E">Address Type</span></b> : Resolvable Private Address. 
     *              If the IRK of local device has not been registered in Resolving List, Public Address is used. \n 
     *              <b><span style="color:#307D7E">Filter</span></b> : White List is not used. 
     *              The remote device to be connected is specified by the remote device address parameter is used. </td>
     *      </tr>
     *      <tr>
     *          <td> @ref BLE_ABS_CONN_USE_WLST_RPA_PUBLIC ( @ref BLE_GAP_INIT_FILT_USE_WLST | 
     *               ( @ref BLE_GAP_ADDR_RPA_ID_PUBLIC << 4))</td>
     *          <td><b><span style="color:#307D7E">Address Type</span></b> : Resolvable Private Address. 
     *              If the IRK of local device has not been registered in Resolving List, Public Address is used. \n 
     *              <b><span style="color:#307D7E">Filter</span></b> : White List is used. 
     *              The remote device registered in White List is connected 
     *              with local device. \n The p_addr parameter is used to refer to Resolving List. </td>
     *      </tr>
     *      <tr>
     *          <td> @ref BLE_ABS_CONN_USE_ADDR_RPA_STATIC ( @ref BLE_GAP_INIT_FILT_USE_ADDR | 
     *               ( @ref BLE_GAP_ADDR_RPA_ID_RANDOM << 4))</td>
     *          <td><b><span style="color:#307D7E">Address Type</span></b> : Resolvable Private Address. 
     *              If the IRK of local device has not been registered in Resolving List, the Static Address set 
     *              by @ref R_BLE_GAP_SetRandAddr() or @ref R_BLE_VS_SetBdAddr() is used. \n 
     *              <b><span style="color:#307D7E">Filter</span></b> : White List is not used. 
     *              The remote device to be connected is specified by the remote device address parameter is used. </td>
     *      </tr>
     *      <tr>
     *          <td> @ref BLE_ABS_CONN_USE_WLST_RPA_STATIC ( @ref BLE_GAP_INIT_FILT_USE_WLST | 
     *               ( @ref BLE_GAP_ADDR_RPA_ID_RANDOM << 4))</td>
     *          <td><b><span style="color:#307D7E">Address Type</span></b> : Resolvable Private Address. 
     *              If the IRK of local device has not been registered in Resolving List, the static address set 
     *              by @ref R_BLE_GAP_SetRandAddr() or @ref R_BLE_VS_SetBdAddr() is used. \n 
     *              <b><span style="color:#307D7E">Filter</span></b> : White List is used. 
     *              The remote device registered in White List is connected 
     *              with local device. \n The p_addr parameter is used to refer to Resolving List. </td>
     *      </tr>
     */
    uint8_t filter;

    /**
     *  @brief The time(sec) to cancel the create connection request. \n
     *  Valid range is 0 <= conn_to <= 10. \n
     *  If the conn_to field is 0, the create connection request is not canceled.
     */
    uint8_t conn_to;

    /**
     *  @brief Padding
     */
    uint8_t padding[2];

} st_ble_abs_conn_param_t;
/*@}*/



/* ============================================== ABS API Declarations ============================================== */
/** @defgroup abs_api_func Functions 
 *  @{
 *  @brief Function definition
 */
#ifdef __cplusplus
extern "C" {
#endif



/******************************************************************************************************************//**
 * @fn ble_status_t R_BLE_ABS_Init(st_ble_abs_init_param_t * p_init_param)
 * @brief   Initialize the Host Stack. 
 * @details Host stack is initialized with this function. Before using All the R_BLE APIs, 
 *          it's necessary to call this function. A callback functions are registered with this function. 
 *          In order to receive the GAP, GATT, Vendor specific event, it's necessary to register a callback function.
 *          The result of this API call is notified in @ref BLE_GAP_EVENT_STACK_ON event.
 * @note    Because abstraction API uses software timer, call @ref R_BLE_TIMER_Init() before @ref R_BLE_ABS_Init().
 * @param[in] p_init_param A callback functions registered with this function.
 * @retval  BLE_SUCCESS(0x0000) Success 
 * @retval  BLE_ERR_INVALID_PTR(0x0001) p_init_param or gap_cb is specified as NULL. 
 * @retval  BLE_ERR_INVALID_ARG(0x0003) The pairing parameter is out of range. 
 * @retval  BLE_ERR_UNSUPPORTED(0x0007) Not supported.
 * @retval  BLE_ERR_INVALID_STATE(0x0008) The reason for this error is as follows:
 *          - Host Stack was already initialized.
 *          - The task for host stack is not running.  
 * @retval  BLE_ERR_CONTEXT_FULL(0x000B) Callback function has already registered.
 * @retval  BLE_ERR_MEM_ALLOC_FAILED(0x000C) Insufficient memory is needed to generate this function. 
 * @details 
 *          <b>Events</b>\n
 *          \arg @ref BLE_GAP_EVENT_STACK_ON 
 *
 *          <b>Message Sequence Chart</b>\n
 *          \arg @ref subsection_msc_abs_init
 **********************************************************************************************************************/
ble_status_t R_BLE_ABS_Init(st_ble_abs_init_param_t * p_init_param);

/******************************************************************************************************************//**
 * @fn void R_BLE_ABS_Reset(ble_event_cb_t init_cb)
 * @brief   Reset BLE.
 * @details BLE is reset with this function. The process is carried out in the following order.
 *          - @ref R_BLE_Close() 
 *          - @ref R_BLE_GAP_Terminate()
 *          - @ref R_BLE_Open()
 *          - @ref R_BLE_SetEvent()
 * 
 *          The init_cb callback initializes the others (Host Stack, timer, etc...).
 * @param[in] init_cb  callback function.
 * @retval  none
 * @details 
 *          <b>Message Sequence Chart</b>\n
 *          \arg @ref subsection_msc_abs_reset
 **********************************************************************************************************************/
void R_BLE_ABS_Reset(ble_event_cb_t init_cb);

/******************************************************************************************************************//**
 * @fn ble_status_t R_BLE_ABS_StartLegacyAdv(st_ble_abs_legacy_adv_param_t * p_adv_param)
 * @brief   Start Legacy Connectable Advertising.
 * @details Start Legacy Advertising after setting advertising parameters, advertising data and scan response data. \n
 *          Advertising configuration for this function is as follows.
 *          \arg The legacy advertising uses the advertising set whose advertising handle is 0.
 *          \arg The advertising type is connectable and scannable undirect
 *          ( @ref BLE_GAP_LEGACY_PROP_ADV_IND).
 *          \arg Scan request event( @ref BLE_GAP_EVENT_SCAN_REQ_RECV ) is not notified.
 *           
 *          The relationship between fast_intv, fast_period, slow_intv and slow_period field 
 *          in p_adv_param parameter is shown in @ref Figure 1.1.
 *          @image html "abs_adv_period_en.svg" "Figure 1.1" width=1000px
 * @param[in] p_adv_param Advertising parameters for Legacy Advertising.
 * @retval  BLE_SUCCESS(0x0000) Success 
 * @retval  BLE_ERR_INVALID_PTR(0x0001) p_adv_param is specified as NULL. 
 * @retval  BLE_ERR_INVALID_ARG(0x0003) The advertising parameter is out of range. 
 * @retval  BLE_ERR_UNSUPPORTED(0x0007) Not supported.
 * @retval  BLE_ERR_INVALID_STATE(0x0008) The reason for this error is as follows:
 *          - Host stack hasn't been initialized. 
 *          - Legacy Advertising has been already started by R_BLE_ABS_StartLegacyAdv().  
 *          - Because the @ref BLE_CFG_RF_ADV_SET_MAX number of advertisings have been started, 
 *            R_BLE_ABS_StartLegacyAdv() cannot allocate an advertising set.
 * @retval  BLE_ERR_INVALID_STATE(0x0008) Host stack hasn't been initialized. 
 * @retval  BLE_ERR_MEM_ALLOC_FAILED(0x000C) Insufficient memory is needed to generate this function. 
 * @details 
 *          <b>Events</b>\n
 *          \arg @ref BLE_GAP_EVENT_ADV_PARAM_SET_COMP 
 *          \arg @ref BLE_GAP_EVENT_ADV_DATA_UPD_COMP 
 *          \arg @ref BLE_GAP_EVENT_ADV_ON 
 *          \arg @ref BLE_GAP_EVENT_ADV_OFF 
 *
 *          <b>Message Sequence Chart</b>\n
 *          \arg @ref subsection_msc_abs_legacy_adv
 **********************************************************************************************************************/
ble_status_t R_BLE_ABS_StartLegacyAdv(st_ble_abs_legacy_adv_param_t * p_adv_param);

/******************************************************************************************************************//**
 * @fn ble_status_t R_BLE_ABS_StartExtAdv(st_ble_abs_ext_adv_param_t * p_adv_param)
 * @brief   Start Extended Connectable Advertising.
 * @details Start Extended Advertising after setting advertising parameters, advertising data. \n
 *          Advertising configuration for this function is as follows.
 *          \arg The extended advertising uses the advertising set whose advertising handle is 1.
 *          \arg The advertising type is connectable and non-scannable undirect
 *          ( @ref BLE_GAP_EXT_PROP_ADV_CONN_NOSCAN_UNDIRECT ).
 *          \arg Scan request event( @ref BLE_GAP_EVENT_SCAN_REQ_RECV ) is not notified.
 *          \arg Secondary Advertising Max Skip is 0.
 *          The relationship between fast_intv, fast_period, 
 *          slow_intv and slow_period field in p_adv_param parameter is shown in @ref Figure 1.1 
 *          
 * @note If the BLE Protocol Stack library type is Balance or Compact, 
 *       this function returns @ref BLE_ERR_UNSUPPORTED(0x0007).
 *       
 * @param[in] p_adv_param Advertising parameters for Extended Advertising.
 * @retval  BLE_SUCCESS(0x0000) Success 
 * @retval  BLE_ERR_INVALID_PTR(0x0001) p_adv_param is specified as NULL. 
 * @retval  BLE_ERR_INVALID_ARG(0x0003) The advertising parameter is out of range. 
 * @retval  BLE_ERR_UNSUPPORTED(0x0007) Not supported.
 * @retval  BLE_ERR_INVALID_STATE(0x0008) The reason for this error is as follows:
 *          - Host stack hasn't been initialized. 
 *          - Extended Advertising has been already started by R_BLE_ABS_StartExtAdv().  
 *          - Because the @ref BLE_CFG_RF_ADV_SET_MAX number of advertisings have been started, 
 *            R_BLE_ABS_StartExtAdv() cannot allocate an advertising set.
 * @retval  BLE_ERR_MEM_ALLOC_FAILED(0x000C) Insufficient memory is needed to generate this function. 
 * @details 
 *          <b>Events</b>\n
 *          \arg @ref BLE_GAP_EVENT_ADV_PARAM_SET_COMP 
 *          \arg @ref BLE_GAP_EVENT_ADV_DATA_UPD_COMP 
 *          \arg @ref BLE_GAP_EVENT_ADV_ON 
 *          \arg @ref BLE_GAP_EVENT_ADV_OFF 
 * 
 *          <b>Message Sequence Chart</b>\n
 *          \arg @ref subsection_msc_abs_ext_adv
 **********************************************************************************************************************/
ble_status_t R_BLE_ABS_StartExtAdv(st_ble_abs_ext_adv_param_t * p_adv_param);

/******************************************************************************************************************//**
 * @fn ble_status_t R_BLE_ABS_StartNonConnAdv(st_ble_abs_non_conn_adv_param_t * p_adv_param)
 * @brief   Start Non-Connectable Advertising.
 * @details Start Non-Connectable Advertising after setting advertising parameters, advertising data. \n
 *          Advertising configuration for this function is as follows.
 *           \arg The non-connectable advertising uses the advertising set whose advertising handle is 2.
 *          \arg The advertising type is non-connectable and non-scannable undirect.
 *          ( @ref BLE_GAP_EXT_PROP_ADV_NOCONN_NOSCAN_UNDIRECT or @ref BLE_GAP_LEGACY_PROP_ADV_NONCONN_IND)
 *          \arg Scan request event( @ref BLE_GAP_EVENT_SCAN_REQ_RECV ) is not notified.
 *          \arg Secondary Advertising Max Skip is 0.
 *          
 * @param[in] p_adv_param Advertising parameters for Non-Connectable Advertising.
 * @retval  BLE_SUCCESS(0x0000) Success 
 * @retval  BLE_ERR_INVALID_PTR(0x0001) p_adv_param is specified as NULL. 
 * @retval  BLE_ERR_INVALID_ARG(0x0003) The advertising parameter is out of range. 
 * @retval  BLE_ERR_UNSUPPORTED(0x0007) Not supported.
 * @retval  BLE_ERR_INVALID_STATE(0x0008) The reason for this error is as follows:
 *          - Host stack hasn't been initialized. 
 *          - Non-Connectable Advertising has been already started by R_BLE_ABS_StartNonConnAdv().  
 *          - Because the @ref BLE_CFG_RF_ADV_SET_MAX number of advertisings have been started, 
 *            R_BLE_ABS_StartNonConnAdv() cannot allocate an advertising set.
 * @retval  BLE_ERR_MEM_ALLOC_FAILED(0x000C) Insufficient memory is needed to generate this function. 
 * @details 
 *          <b>Events</b>\n
 *          \arg @ref BLE_GAP_EVENT_ADV_PARAM_SET_COMP 
 *          \arg @ref BLE_GAP_EVENT_ADV_DATA_UPD_COMP 
 *          \arg @ref BLE_GAP_EVENT_ADV_ON 
 *          \arg @ref BLE_GAP_EVENT_ADV_OFF 
 * 
 *          <b>Message Sequence Chart</b>\n
 *          \arg @ref subsection_msc_abs_non_conn_adv
 **********************************************************************************************************************/
ble_status_t R_BLE_ABS_StartNonConnAdv(st_ble_abs_non_conn_adv_param_t * p_adv_param);

/******************************************************************************************************************//**
 * @fn ble_status_t R_BLE_ABS_StartPerdAdv(st_ble_abs_perd_adv_param_t * p_adv_param)
 * @brief   Start Periodic Advertising.
 * @details Start Periodic Advertising after setting advertising parameters, periodic advertising parameters, 
 *          advertising data and periodic advertising data. \n
 *          Advertising configuration for this function is as follows.
 *          \arg The periodic advertising uses the advertising set whose advertising handle is 3.
 *          \arg The advertising type is non-connectable and non-scannable undirect.
 *          ( @ref BLE_GAP_EXT_PROP_ADV_NOCONN_NOSCAN_UNDIRECT)
 *          \arg Scan request event( @ref BLE_GAP_EVENT_SCAN_REQ_RECV ) is not notified.
 *          \arg Secondary Advertising Max Skip is 0. 
 *          
 * @note If the BLE Protocol Stack library type is Balance or Compact, 
 *       this function returns @ref BLE_ERR_UNSUPPORTED(0x0007).
 *       
 * @param[in] p_adv_param Advertising parameters for Periodic Advertising.
 * @retval  BLE_SUCCESS(0x0000) Success 
 * @retval  BLE_ERR_INVALID_PTR(0x0001) p_adv_param is specified as NULL. 
 * @retval  BLE_ERR_INVALID_ARG(0x0003) The advertising parameter is out of range. 
 * @retval  BLE_ERR_UNSUPPORTED(0x0007) Not supported.
 * @retval  BLE_ERR_INVALID_STATE(0x0008) The reason for this error is as follows:
 *          - Host stack hasn't been initialized. 
 *          - Periodic Advertising has been already started by R_BLE_ABS_StartPerdAdv().  
 *          - Because the @ref BLE_CFG_RF_ADV_SET_MAX number of advertisings have been started, 
 *            R_BLE_ABS_StartPerdAdv() cannot allocate an advertising set.
 * @retval  BLE_ERR_MEM_ALLOC_FAILED(0x000C) Insufficient memory is needed to generate this function. 
 * @details 
 *          <b>Events</b>\n
 *          \arg @ref BLE_GAP_EVENT_ADV_PARAM_SET_COMP
 *          \arg @ref BLE_GAP_EVENT_ADV_DATA_UPD_COMP
 *          \arg @ref BLE_GAP_EVENT_PERD_ADV_PARAM_SET_COMP
 *          \arg @ref BLE_GAP_EVENT_PERD_ADV_ON
 *          \arg @ref BLE_GAP_EVENT_ADV_ON
 *          \arg @ref BLE_GAP_EVENT_ADV_OFF
 * 
 *          <b>Message Sequence Chart</b>\n
 *          \arg @ref subsection_msc_abs_perd_adv
 **********************************************************************************************************************/
ble_status_t R_BLE_ABS_StartPerdAdv(st_ble_abs_perd_adv_param_t * p_adv_param);

