renesas/rx-driver-package/source/r_ble_rx23w/r_ble_rx23w_vx.xx/r_ble_rx23w/src/app_lib/abs/r_ble_abs_api.h
/******************************************************************************************************************//**
 * @fn ble_status_t R_BLE_ABS_StartScan(st_ble_abs_scan_param_t * p_scan_param)
 * @brief   Start scanning.
 * @details Start scanning after setting scan parameters.
 *          Scanning configuration for this function is as follows.
 *          \arg The type of the procedure is Observation Procedure( @ref BLE_GAP_SC_PROC_OBS(0x00)).
 * 
 *          The result of this API call is notified in @ref BLE_GAP_EVENT_SCAN_ON event. \n
 *          Advertising report is notified in @ref BLE_GAP_EVENT_ADV_REPT_IND event. \n
 *          The relationship between fast_intv, fast_period, slow_intv and slow_period field 
 *          in p_scan_param parameter is shown in @ref Figure 1.2. \n
 *          After the fast scanning with fast_intv/fast_window for "fast_period", 
 *          the slow scanning with slow_intv/slow_window runs for "slow_period". \n
 *          The following table shows the events notified at "Scan Start", "Scan Switch", "Scan End" in @ref Figure 1.2. 
 *          | BLE Protocol Stack library      | Scan Start                 | Scan Switch                                               | Scan End                    |
 *          |:------------------------------- |:-------------------------- |:--------------------------------------------------------- |:--------------------------- |
 *          | all features                    | @ref BLE_GAP_EVENT_SCAN_ON | @ref BLE_GAP_EVENT_SCAN_TO \n @ref BLE_GAP_EVENT_SCAN_ON  | @ref BLE_GAP_EVENT_SCAN_TO  |
 *          | balance                         | @ref BLE_GAP_EVENT_SCAN_ON | @ref BLE_GAP_EVENT_SCAN_OFF \n @ref BLE_GAP_EVENT_SCAN_ON | @ref BLE_GAP_EVENT_SCAN_OFF |
 *          If fast_period is 0, only the slow scanning with slow_intv/slow_window is performed. \n
 *          If slow_period is 0, the slow scanning with slow_intv/slow_window continues.
 * 
 *          @image html "abs_api_scan_period_en.svg" "Figure 1.2" width=1000px
 * @param   p_scan_param Scan parameters.
 * @retval  BLE_SUCCESS(0x0000) Success 
 * @retval  BLE_ERR_INVALID_PTR(0x0001) p_scan_param is specified as NULL. 
 * @retval  BLE_ERR_INVALID_ARG(0x0003) The scan parameter is out of range. 
 * @retval  BLE_ERR_UNSUPPORTED(0x0007) Not supported.
 * @retval  BLE_ERR_INVALID_STATE(0x0008) Host stack hasn't been initialized. 
 * @retval  BLE_ERR_MEM_ALLOC_FAILED(0x000C) Insufficient memory is needed to generate this function. 
 * @details 
 *          <b>Events</b>\n
 *          \arg @ref BLE_GAP_EVENT_SCAN_ON 
 *          \arg @ref BLE_GAP_EVENT_SCAN_OFF 
 *          \arg @ref BLE_GAP_EVENT_SCAN_TO 
 *          \arg @ref BLE_GAP_EVENT_ADV_REPT_IND 
 * 
 *          <b>Message Sequence Chart</b>\n
 *          \arg @ref subsection_msc_abs_scan
 **********************************************************************************************************************/
ble_status_t R_BLE_ABS_StartScan(st_ble_abs_scan_param_t * p_scan_param);

/******************************************************************************************************************//**
 * @fn ble_status_t R_BLE_ABS_CreateConn(st_ble_abs_conn_param_t * p_conn_param)
 * @brief   Request create connection.
 * @details The configuration for the request for creating connection is as follows.\n
 *          \arg The scan interval is 60ms and the scan window is 30ms in case of 1M PHY or 2M PHY.
 *          \arg The scan interval is 180ms and the scan window is 90ms in case of coded PHY.
 *          \arg The Minimum CE Length and the Maximum CE Length are 0xFFFF.
 * 
 *          When the request for a connection has been received by the Controller, 
 *          @ref BLE_GAP_EVENT_CREATE_CONN_COMP event is notified.
 *          When a link has been established, @ref BLE_GAP_EVENT_CONN_IND event is notified.
 * @param   p_conn_param Create connection parameters.
 * @retval  BLE_SUCCESS(0x0000) Success 
 * @retval  BLE_ERR_INVALID_PTR(0x0001) p_conn_param is specified as NULL. 
 * @retval  BLE_ERR_INVALID_ARG(0x0003) The create connection parameter is out of range. 
 * @retval  BLE_ERR_UNSUPPORTED(0x0007) Not supported.
 * @retval  BLE_ERR_INVALID_STATE(0x0008) Host stack hasn't been initialized. 
 * @retval  BLE_ERR_ALREADY_IN_PROGRESS(0x000A) The same BD_ADDR as the address of a connected remote device is specified. 
 * @retval  BLE_ERR_MEM_ALLOC_FAILED(0x000C) Insufficient memory is needed to generate this function. 
 * @details 
 *          <b>Events</b>\n
 *          \arg @ref BLE_GAP_EVENT_CREATE_CONN_COMP
 *          \arg @ref BLE_GAP_EVENT_CONN_CANCEL_COMP 
 *          \arg @ref BLE_GAP_EVENT_CONN_IND
 * 
 *          <b>Message Sequence Chart</b>\n
 *          \arg @ref subsection_msc_abs_conn
 **********************************************************************************************************************/
ble_status_t R_BLE_ABS_CreateConn(st_ble_abs_conn_param_t * p_conn_param);

/******************************************************************************************************************//**
 * @fn ble_status_t R_BLE_ABS_SetLocPrivacy(uint8_t * p_lc_irk, uint8_t privacy_mode)
 * @brief   Configure local device privacy.
 * @details Get address, generate a IRK, add it to the Resolving List, set privacy mode and enable RPA function. \n 
 *          After configuring local device privacy, 
 *          the address specified by the privacy_mode parameter is set to the local identity device address. \n
 *          When calling the advertising/scan/create connection API with local RPA address type, \n
 *          local device RPA is included in the packets.
 * @note    If you use this function, register vendor specific callback function by @ref R_BLE_ABS_Init. \n 
 * @param   p_lc_irk IRK to be registered in the Resolving List. 
 *          If p_lc_irk is specified as NULL, the new IRK is generated.
 * @param   privacy_mode Privacy mode and Local device identity address type. \n
 *          Select one of the following. \n
 *          |  macro                                |   description                                                  |
 *          |:--------------------------------------|:-------------------------------------------------------------- |
 *          | BLE_ABS_PRIV_NET_PUBLIC_IDADDR(0x00)  | Privacy Mode : Network Mode, Identity Address : Public Address |
 *          | BLE_ABS_PRIV_DEV_PUBLIC_IDADDR(0x01)  | Privacy Mode : Device Mode,  Identity Address : Public Address |
 *          | BLE_ABS_PRIV_NET_STATIC_IDADDR(0x02)  | Privacy Mode : Network Mode, Identity Address : Static Address |
 *          | BLE_ABS_PRIV_DEV_STATIC_IDADDR(0x03)  | Privacy Mode : Device Mode,  Identity Address : Static Address |
 * @retval  BLE_SUCCESS(0x0000) Success 
 * @retval  BLE_ERR_INVALID_ARG(0x0003) The privacy_mode parameter is out of range. 
 * @retval  BLE_ERR_UNSUPPORTED(0x0007) Not supported.
 * @retval  BLE_ERR_INVALID_STATE(0x0008) The reason for this error is as follows: \n
 *                                           - Host stack hasn't been initialized.   \n  
 *                                           - R_BLE_ABS_SetLocPrivacy() has been already started.  
 * @retval  BLE_ERR_MEM_ALLOC_FAILED(0x000C) Insufficient memory is needed to generate this function. 
 * @details 
 *          <b>Events</b>\n
 *          \arg @ref BLE_GAP_EVENT_RPA_EN_COMP
 *          \arg @ref BLE_VS_EVENT_GET_RAND
 *          \arg @ref BLE_GAP_EVENT_RSLV_LIST_CONF_COMP
 *          \arg @ref BLE_GAP_EVENT_PRIV_MODE_SET_COMP
 *          \arg @ref BLE_VS_EVENT_GET_ADDR_COMP
 * 
 *          <b>Message Sequence Chart</b>\n
 *          \arg @ref subsection_msc_abs_priv
 **********************************************************************************************************************/
ble_status_t R_BLE_ABS_SetLocPrivacy(uint8_t * p_lc_irk, uint8_t privacy_mode);

/******************************************************************************************************************//**
 * @fn ble_status_t R_BLE_ABS_StartAuth(uint16_t conn_hdl)
 * @brief   Start pairing or encryption.
 * @details Start pairing or encryption. If pairing has been done, start encryption.
 *          The pairing parameters are configured by @ref R_BLE_ABS_Init() or @ref R_BLE_GAP_SetPairingParams().
 *          If the pairing parameters are configure by @ref R_BLE_ABS_Init(), 
 *          - bonding policy is that bonding information is stored.
 *          - Key press notification is not supported.
 *          
 * @param   conn_hdl Connection handle identifying the remote device 
 *                   which local device starts pairing or encryption with.
 * @retval  BLE_SUCCESS(0x0000) Success 
 * @retval  BLE_ERR_UNSUPPORTED(0x0007) Not supported.
 * @retval  BLE_ERR_INVALID_STATE(0x0008) Host stack hasn't been initialized or 
 *                                        while generating OOB data, this function was called.
 * @retval  BLE_ERR_MEM_ALLOC_FAILED(0x000C) Insufficient memory is needed to generate this function. 
 * @retval  BLE_ERR_INVALID_HDL(0x000E) The remote device specified by conn_hdl is not found. 
 * @details 
 *          <b>Events</b>\n
 *          \arg @ref BLE_GAP_EVENT_PAIRING_REQ
 *          \arg @ref BLE_GAP_EVENT_PASSKEY_ENTRY_REQ
 *          \arg @ref BLE_GAP_EVENT_PASSKEY_DISPLAY_REQ
 *          \arg @ref BLE_GAP_EVENT_NUM_COMP_REQ
 *          \arg @ref BLE_GAP_EVENT_KEY_PRESS_NTF
 *          \arg @ref BLE_GAP_EVENT_PEER_KEY_INFO
 *          \arg @ref BLE_GAP_EVENT_EX_KEY_REQ
 *          \arg @ref BLE_GAP_EVENT_PAIRING_COMP
 *          \arg @ref BLE_GAP_EVENT_LTK_REQ
 *          \arg @ref BLE_GAP_EVENT_LTK_RSP_COMP
 *          \arg @ref BLE_GAP_EVENT_ENC_CHG
 * 
 *          <b>Message Sequence Chart</b>\n
 *          \arg @ref subsection_msc_abs_auth_master
 *          \arg @ref subsection_msc_abs_auth_slave
 **********************************************************************************************************************/
ble_status_t R_BLE_ABS_StartAuth(uint16_t conn_hdl);

#ifdef __cplusplus
};
#endif

/*@}*/

#endif /* R_BLE_ABS_API_H */

/*@}*/
